tag-emacs/config/emacs/profiles/oikeiosis/README.org
#+title: Oikei么sis
#+property: header-args :tangle init.el

An Emacs configuration of my own mind and sensibilities.

* Early initialization

** Lexical binding

Lexical binding is useful for performance reasons and to make sure that closures work properly.

#+begin_src elisp :tangle early-init.el
;;; early-init.el -*- lexical-binding: t; -*-
#+end_src

#+begin_src elisp :tangle init.el
;;; init.el -*- lexical-binding: t; -*-
#+end_src

** Garbage collection

In order for startup to be as fast as possible, this disables garbage collection until later.

#+begin_src elisp :tangle early-init.el
(setq gc-cons-threshold most-positive-fixnum)
#+end_src

** Look and feel during boot up

Since I intend my Emacs to be keyboard-centric, I disable the chrome for the window. I do this within =early-init.el= because it can impact the performance of startup and the way the initially shows. Otherwise, I would move this to the [[*User interface][User interface]] section.

#+begin_src elisp :tangle early-init.el
(push '(menu-bar-mode . 0)    default-frame-alist)
(push '(tool-bar-mode . 0)    default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)

(setq menu-bar-mode nil
      scroll-bar-mode nil
      tool-bar-mode nil)
#+end_src

* Preamble

I use these variables to check for specific feature flags. Specifically, when debugging, launch Emacs with =DEBUG=t= to set the central debugger flag.

#+begin_src elisp
(defvar oik-debug-p (or (getenv-internal "DEBUG") init-file-debug)
  "If non-nil, Oikei么sis enables debugging for the whole of Emacs.")
#+end_src

I use these constants throughout the code base to store different files and keep the Emacs profile directory clean.

#+begin_src elisp
(defconst oik-cache-dir (format "%s/oikeiosis/"
                                (or (getenv "XDG_CACHE_HOME") "~/.cache"))
  "Where to write non-essential cached data files.")

(defconst oik-data-dir (format "%s/oikeiosis/"
                               (or (getenv "XDG_DATA_HOME") "~/.local/share"))
  "Where to write user-specific data files.")

(defconst oik-private-dir (format "%s/oikeiosis/"
                                  (or (getenv "XDG_CONFIG_HOME") "~/.config"))
  "Where to store private configuration like customizations.")

(defconst oik-state-dir (format "%s/oikeiosis/"
                                (or (getenv "XDG_STATE_HOME") "~/.local/state"))
  "Where to store state, like compiled files and pids.")
#+end_src

Since I use both Linux and macOS, I have some configuration that only applies to specific operating systems. These predicates detect those states:

#+begin_src elisp
(defconst oik-linux-p (eq system-type 'gnu/linux)
  "When running on a Linux machine, this will be `t'.")

(defconst oik-macos-p (eq system-type 'darwin)
  "When running on a macOS machine, this will be `t'.")
#+end_src

* Native compilation

Emacs 29 changes the name of one of the native compilation variables. This shims it back in for cases where a package hasn't updated to it.

#+begin_src elisp
(unless (boundp 'native-comp-deferred-compilation-deny-list)
  (defvaralias 'native-comp-deferred-compilation-deny-list 'native-comp-jit-compilation-deny-list))
#+end_src

Move the native compilation cache out of my =user-emacs-directory= into somewhere more suited for long-term storage.

#+begin_src elisp
(when (boundp 'native-comp-eln-load-path)
  (add-to-list 'native-comp-eln-load-path (concat oik-state-dir "eln/")))
#+end_src

Disable compilation for some packages that can't currently compile.

#+begin_src elisp
(with-eval-after-load 'comp
  (mapc (apply-partially #'add-to-list 'native-comp-deferred-compilation-deny-list)
        (let ((local-dir-re (concat "\\`" (regexp-quote oik-data-dir))))
          (list (concat local-dir-re ".*/with-editor\\.el\\'")))))
#+end_src

* Quiet startup

During startup, Emacs loads many libraries. Some of these libraries are old and use the legacy advice system. When doing so, they redefine functions and issue a warning. Without touching those packages upstream, there is not a way to prevent this from happening. As such, I choose to silently accept the redefinitions to reduce startup cruft.

#+begin_src elisp
(setq ad-redefinition-action 'accept)
#+end_src

Emacs allows you to debug things along the way. This setting centralizes debugging via the =DEBUG= environment variable.

#+begin_src elisp
(setq debug-on-error oik-debug-p
      jka-compr-verbose oik-debug-p)
#+end_src

Emacs, being a GNU project, does a lot of proselytizing throughout the program. I know all about the GNU Project and Emacs; I don't need them to sell me on it. As such, I disable said evangelism.

#+begin_src elisp
(unless (daemonp)
  (advice-add #'display-startup-echo-area-message :override #'ignore))
#+end_src

Emacs also outputs a lot of information to =*Messages*= upon startup. I need any of those messages and it leaves cruft to parse through whenever I need to debug anything, so I disable as many of these as I can:

#+begin_src elisp
(setq inhibit-startup-message t
      inhibit-startup-echo-area-message user-login-name
      inhibit-default-init t)
#+end_src

I took this idea from Doom: start up in fundamental mode because it's the fastest mode and we don't have enough information /a priori/ to make a decision until the normal mode hooks kick in. Also, I prevent the instructional message in the scratch buffer since I know how it works already.

#+begin_src elisp
(setq initial-major-mode 'fundamental-mode
      initial-scratch-message nil)
#+end_src

* Keep the profile directory clean

Emacs uses the =.emacs.d= directory to store everything, but this is a new century from when Emacs came to be. We have dedicated locations for storing data now so let's use them and keep the profile directory clean.

#+begin_src elisp
(setq async-byte-compile-log-file (concat oik-cache-dir "async-bytecomp.log")
      custom-file                 (concat oik-private-dir "custom.el")
      pcache-directory            (concat oik-cache-dir "pcache/")
      request-storage-directory   (concat oik-cache-dir "request")
      shared-game-score-directory (concat oik-data-dir "shared-game-score/"))
#+end_src

* Optimizations

This section is a grab-bag of stuff, mostly from Doom, to optimize the performance of Emacs.

Emacs performs a second pass through the auto-mode list to allow for case-insensitive matches. This made a lot of sense back when some filesystems presented files in =SNAKE_CASE= but isn't really something that comes up. People tend to follow the conventions of their particular languages anymore, so I don't rely on case-insensitivity for mode changes:

#+begin_src elisp
(setq auto-mode-case-fold nil)
#+end_src

Emacs' find-at-point behavior tries to be helpful by doing things such as pinging values that look like domain names. This can lead to delays, so I disable the pinging behavior.

#+begin_src elisp
(setq ffap-machine-p-known 'reject)
#+end_src

By default, Emacs only reads 4KiB from a process per chunk. This is a sensible default, but on modern systems this can lead to slow data streaming. Let's increase that setting:

#+begin_src elisp
(setq read-process-output-max (* 64 1024))  ; 64KiB
#+end_src

Emacs can run on myriad systems and thus defines options for each of those systems. To optimize what it needs to process at startup, I disable command line options that do not apply to the particular system.

#+begin_src elisp
(unless oik-macos-p (setq command-line-ns-option-alist nil))
(unless (memq initial-window-system '(x)) (setq command-line-x-option-alist nil))
#+end_src

When running in a terminal, =tty-run-terminal-initialization= is slow during startup, but runs well later. As a hack around this issue, I defer it until after window setup. (Note: This is a hack from Doom!)

#+begin_src elisp
(unless (and (daemonp) initial-window-system)
  (advice-add #'tty-run-terminal-initialization :override #'ignore)
  (add-hook 'window-setup-hook
            (defun oik--reset-tty-run-terminal-initialization-h ()
              "Runs the terminal initialization"
              (advice-remove #'tty-run-terminal-initialization #'ignore)
              (tty-run-terminal-initialization (selected-frame) nil t))))
#+end_src

** Disable bidirectional text mode

I cannot read or write any language that isn't left-to-right so I truly do not need bidirectional text within my editor.

#+begin_src elisp
(setq-default bidi-display-reordering 'left-to-right)
(setq bidi-inhibit-bpa t
      bidi-paragraph-direction 'left-to-right
      bidi-paragraph-separate-re nil
      bidi-paragraph-start-re nil)
#+end_src

** UI optimizations

Rendering in Emacs (or any other editor) is the expensive part. So performing tweaks to the UI rendering can give you good gains in performance.

When switching to a different window, don't display highlighted sections or cursors to reduce rendering work.

#+begin_src elisp
(setq-default cursor-in-non-selected-windows nil)
(setq highlight-nonselected-windows nil)
#+end_src

I use the performant scrolling mode. Occasionally when navigating, you'll end up with a garbage display toward the top or bottom of the window. This self-corrects as you move around the file and is something that I do not find too distracting; your mileage may vary.

#+begin_src elisp
(setq fast-but-imprecise-scrolling t)
#+end_src

Resizing, particularly when changing a font size, is an expensive part of redrawing the frame. I don't particularly care to have the frame resize when changing my font; I like the frame to stay a specific size since I normally use a tiling window manager (on Linux) or have manually sized windows (on macOS). Thus, disabling the frame resize can make font size changes faster without affecting me:

#+begin_src elisp
(setq frame-inhibit-implied-resize t)
#+end_src

The tick rate for updating an idle display defaults to a half-second. There is no need for it to update that much when I'm not using Emacs, so I slow it down to once per second.

#+begin_src elisp
(setq idle-update-delay 1.0)
#+end_src

Emacs tries to compact the font cache, which is expensive. In the interest of trading memory for speed, let's disable the compaction:

#+begin_src elisp
(setq inhibit-compacting-font-caches t)
#+end_src

Do not try to apply fonts when receiving input in an attempt to help with scrolling performance. This setting is recent (commit =b2f8c9f= in Emacs 28) and has similar trade-offs to =fast-but-imprecise-scrolling=.

#+begin_src elisp
(setq redisplay-skip-fontification-on-input t)
#+end_src

