tag-emacs/config/emacs/profiles/oikeiosis/init.el
;;; init.el -*- lexical-binding: t; -*-

(defvar oik-debug-p (or (getenv-internal "DEBUG") init-file-debug)
  "If non-nil, Oikeiôsis enables debugging for the whole of Emacs.")

(defconst oik-cache-dir (format "%s/oikeiosis/"
                                (or (getenv "XDG_CACHE_HOME") "~/.cache"))
  "Where to write non-essential cached data files.")

(defconst oik-data-dir (format "%s/oikeiosis/"
                               (or (getenv "XDG_DATA_HOME") "~/.local/share"))
  "Where to write user-specific data files.")

(defconst oik-private-dir (format "%s/oikeiosis/"
                                  (or (getenv "XDG_CONFIG_HOME") "~/.config"))
  "Where to store private configuration like customizations.")

(defconst oik-state-dir (format "%s/oikeiosis/"
                                (or (getenv "XDG_STATE_HOME") "~/.local/state"))
  "Where to store state, like compiled files and pids.")

(defconst oik-linux-p (eq system-type 'gnu/linux)
  "When running on a Linux machine, this will be `t'.")

(defconst oik-macos-p (eq system-type 'darwin)
  "When running on a macOS machine, this will be `t'.")

(unless (boundp 'native-comp-deferred-compilation-deny-list)
  (defvaralias 'native-comp-deferred-compilation-deny-list 'native-comp-jit-compilation-deny-list))

(when (boundp 'native-comp-eln-load-path)
  (add-to-list 'native-comp-eln-load-path (concat oik-state-dir "eln/")))

(with-eval-after-load 'comp
  (mapc (apply-partially #'add-to-list 'native-comp-deferred-compilation-deny-list)
        (let ((local-dir-re (concat "\\`" (regexp-quote oik-data-dir))))
          (list (concat local-dir-re ".*/with-editor\\.el\\'")))))

(setq ad-redefinition-action 'accept)

(setq debug-on-error oik-debug-p
      jka-compr-verbose oik-debug-p)

(unless (daemonp)
  (advice-add #'display-startup-echo-area-message :override #'ignore))

(setq inhibit-startup-message t
      inhibit-startup-echo-area-message user-login-name
      inhibit-default-init t)

(setq initial-major-mode 'fundamental-mode
      initial-scratch-message nil)

(setq async-byte-compile-log-file (concat oik-cache-dir "async-bytecomp.log")
      custom-file                 (concat oik-private-dir "custom.el")
      pcache-directory            (concat oik-cache-dir "pcache/")
      request-storage-directory   (concat oik-cache-dir "request")
      shared-game-score-directory (concat oik-data-dir "shared-game-score/"))

(setq auto-mode-case-fold nil)

(setq ffap-machine-p-known 'reject)

(setq read-process-output-max (* 64 1024))  ; 64KiB

(unless oik-macos-p (setq command-line-ns-option-alist nil))
(unless (memq initial-window-system '(x)) (setq command-line-x-option-alist nil))

(unless (and (daemonp) initial-window-system)
  (advice-add #'tty-run-terminal-initialization :override #'ignore)
  (add-hook 'window-setup-hook
            (defun oik--reset-tty-run-terminal-initialization-h ()
              "Runs the terminal initialization"
              (advice-remove #'tty-run-terminal-initialization #'ignore)
              (tty-run-terminal-initialization (selected-frame) nil t))))

(setq-default bidi-display-reordering 'left-to-right)
(setq bidi-inhibit-bpa t
      bidi-paragraph-direction 'left-to-right
      bidi-paragraph-separate-re nil
      bidi-paragraph-start-re nil)

(setq-default cursor-in-non-selected-windows nil)
(setq highlight-nonselected-windows nil)

(setq fast-but-imprecise-scrolling t)

(setq frame-inhibit-implied-resize t)

(setq idle-update-delay 1.0)

(setq inhibit-compacting-font-caches t)

(setq redisplay-skip-fontification-on-input t)
