tag-emacs/config/emacs/profiles/oikeiosis/README.org
* Security

Given that Emacs has nearly as much power as an operating system, we need to make sure it runs securely. This section configures  a variety of security settings to make Emacs more secure.

First, configure GnuTLS with a hardened set of cyphers and settings.

#+begin_src elisp
(setq gnutls-verify-error (not (getenv-internal "INSECURE"))
      gnutls-algorithm-priority
      (when (boundp 'libgnutls-version)
        (concat "SECURE128:+SECURE192:-VERS-ALL"
                (if (>= libgnutls-version 30605)
                    ":+VERS-TLS1.3"
                  ":+VERS-TLS1.2")))
      gnutls-min-prime-bits 3072 ; https://www.keylength.com/en/4/
      tls-checktrust gnutls-verify-error
      tls-program '("openssl s_client -connect %h:%p -CAfile %t -nbio -no_ssl3 -no_tls1 -no_tls1_1 -ign_eof"
                    "gnutls-cli -p %p --dh-bits=3072 --ocsp --x509cafile=%t \
--strict-tofu --priority='SECURE192:+SECURE128:-VERS-ALL:+VERS-TLS1.2:+VERS-TLS1.3' %h"
                    ;; compatibility fallbacks
                    "gnutls-cli -p %p %h"))
#+end_src

Next, disable plaintext credential storage in favor of GPG-encrypted stores.

#+begin_src elisp
(setq auth-sources (list (concat oik-private-dir "authinfo.gpg")
                         "~/.authinfo.gpg"))
#+end_src

* User interface

Trust that I'm doing the right thing, Emacs, when I am creating a new file or buffer.

#+begin_src elisp
(setq confirm-nonexistant-file-or-buffer nil)
#+end_src

Showing the command that I'm typing is important because it's easy to fat-finger commands. As such, I choose to quickly show keystrokes:

#+begin_src elisp
(setq echo-keystrokes 0.02)
#+end_src

Bells, both visual and aural, tend to only be annoying, not helpful. As such, I disable them:

#+begin_src elisp
(setq ring-bell-function #'ignore
      visible-bell nil)
#+end_src

Use a forward-looking difference when attempting to create a shorter, unique name for a buffer:

#+begin_src elisp
(setq uniquify-buffer-name-style 'forward)
#+end_src

I like the look of underlines when Emacs draws them at the descent line instead of the baseline:

#+begin_src elisp
(setq x-underline-at-descent-line t)
#+end_src

When confirming or denying a prompt, I really don't want to have to type =yes= or =no= because =y= and =n= are sufficient. This rebinds the prompt command to the shortened version.

#+begin_src elisp
(fset #'yes-or-no-p #'y-or-n-p)
#+end_src

** Cursor

While the blinking cursor makes it easier to tell where you're focused, it can cause freezes in macOS so I choose to disable the blinking. This also applies to blinking a matching parenthesis.

#+begin_src elisp
(blink-cursor-mode -1)
(setq blink-matching-paren nil)
#+end_src

Stretching the cursor on wide characters makes it hard to tell where your cursor sits, so I choose to disable that functionality.

#+begin_src elisp
(setq x-stretch-cursor nil)
#+end_src

** TODO Fonts

#+begin_src elisp
(defvar oik-font (font-spec :family "FiraCode Nerd Font" :size 16))
(defvar oik-variable-pitch-font (font-spec :family "Noto Sans" :size 20))

(apply #'custom-set-faces
       (let ((attrs '(:weight unspecified :slant unspecified :width unspecified)))
         (append (when oik-font
                   `((fixed-pitch ((t (:font ,oik-font ,@attrs))))))
                 (when oik-variable-pitch-font
                   `((variable-pitch ((t (:font ,oik-variable-pitch-font ,@attrs)))))))))

(dolist (sym '(fixed-pitch variable-pitch))
  (put sym 'saved-face nil))

(setf (alist-get 'font default-frame-alist)
      (font-xlfd-name oik-font))
#+end_src

** Fringe

The fringe is useful space that we do not want to clutter. I disable the fringe indicators for the beginning/end of buffers and empty lines in favor of reserving that space for real information.

#+begin_src elisp
(setq indicate-buffer-boundaries nil
      indicate-empty-lines nil)
#+end_src

** TODO Line numbers

*** display-line-numbers

#+begin_src elisp
(setq display-line-numbers-width 3
      display-line-numbers-widen t
      display-line-numbers-type 'relative)

(add-hook 'prog-mode-hook #'display-line-numbers-mode)
(add-hook 'text-mode-hook #'display-line-numbers-mode)
(add-hook 'conf-mode-hook #'display-line-numbers-mode)
#+end_src

** Minibuffers

Emacs uses minibuffers for myriad tasks and I often find I need to open another minibuffer from the current one. This setting allows that behavior.

#+begin_src elisp
(setq enable-recursive-minibuffers t)
#+end_src

To make it so I can always read output, I allow mini windows (minibuffers and the echo area) to grow when showing long lines.

#+begin_src elisp
(setq resize-mini-windows 'grow-only)
#+end_src

Minibuffers often have read-only areas that can be frustrating to find my cursor within. In order to reduce that frustration, this configures minibuffers to attempt to keep the cursor out of those areas by enabling "intangible" cursor detection and setting hints to keep the cursor out of those areas.

#+begin_src elisp
(setq minibuffer-prompt-properties '(read-only t intangible t cursor-intangible t face minibuffer-prompt))
(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
#+end_src

** Scrolling

When horizontally scrolling, wait until we're close to the edge of the window and then only scroll the minimum amount.

#+begin_src elisp
(setq hscroll-margin 2
      hscroll-step 1)
#+end_src

However, in shell modes, I make it so Emacs will only scroll when hitting the edge of a window because otherwise it causes display glitches.

#+begin_src elisp
(defun oik--disable-hscroll-margin-h ()
  "Set the horizontal scrolling margin to zero to prevent display glitches."
  (setq hscroll-margin 0))

(add-hook 'eshell-mode-hook #'oik--disable-hscroll-margin-h)
(add-hook 'term-mode-hook #'oik--disable-hscroll-margin-h)
#+end_src

Scrolling through large files can be painfully slow when Emacs tries to keep the cursor centered. To prevent this issue, do not recenter when making large jumps in a file, but otherwise attempt to recenter.

#+begin_src elisp
(setq scroll-conservatively 101
      scroll-margin 0
      scroll-preserve-screen-position t)
#+end_src

When attempting to adjust for tall lines or images in a buffer, Emacs attempts to account for it by adjusting the vertical scrolling amount. To save some time when moving the cursor, I disable this behavior because I don't mind stepping through the line or image individually.

#+begin_src elisp
(setq auto-window-vscroll nil)
#+end_src

To make mouse scrolling quicker, I choose to scroll two lines at a time with the mouse wheel and hold =Shift= when I want to scroll horizontally with a mouse wheel:

#+begin_src elisp
(setq mouse-wheel-scroll-amount '(2 ((shift) . hscroll))
      mouse-wheel-scroll-amount-horizontal 2)
#+end_src

** Windows and frames

I use a simple name for frames to make it easier to find them in a list or overview.

#+begin_src elisp
(setq frame-title-format '("%b - Oikei么sis Emacs")
      icon-title-format frame-title-format)
#+end_src

Since I do not use a tiling window manager on macOS, resizing the frame based on the size of the text can lead to a weird display so I allow per-pixel resizes.

#+begin_src elisp
(setq frame-resize-pixelwise t)
#+end_src

However, allowing windows to resize per-pixel can lead to crashes because it causes too many redraws when there are many windows open at once. As such, I disable the functionality for windows.

#+begin_src elisp
(setq window-resize-pixelwise nil)
#+end_src

I use =window-divider-mode= because it can use less space than the native borders between windows. Since I only really need one pixel, that's what I use, and I place them on both bottoms and rights of windows.

#+begin_src elisp
(setq window-divider-default-places t
      window-divider-default-bottom-width 1
      window-divider-default-right-width 1)
(add-hook 'window-setup-hook #'window-divider-mode)
#+end_src

I don't want to use GUIs for anything because they end up being inconsistent across operating systems and I regularly use both Linux and macOS. As such, I choose to disable all GUI widgets.

#+begin_src elisp
(setq use-dialog-box nil)
(when (bound-and-true-p tooltip-mode)
  (tooltip-mode -1))
(when oik-linux-p
  (setq x-gtk-use-system-tooltips nil))
#+end_src

Splitting windows is something I do a lot. Because monitors are wider than they are tall anymore, it makes sense to favor splitting horizontally over vertically. However, I /always/ want to allow splitting vertically because even seeing a single line can be useful.

#+begin_src elisp
(setq split-width-threshold 160
      split-height-threshold nil)
#+end_src

