tag-emacs/config/emacs/profiles/oikeiosis/init.el

(setq gnutls-verify-error (not (getenv-internal "INSECURE"))
      gnutls-algorithm-priority
      (when (boundp 'libgnutls-version)
        (concat "SECURE128:+SECURE192:-VERS-ALL"
                (if (>= libgnutls-version 30605)
                    ":+VERS-TLS1.3"
                  ":+VERS-TLS1.2")))
      gnutls-min-prime-bits 3072 ; https://www.keylength.com/en/4/
      tls-checktrust gnutls-verify-error
      tls-program '("openssl s_client -connect %h:%p -CAfile %t -nbio -no_ssl3 -no_tls1 -no_tls1_1 -ign_eof"
                    "gnutls-cli -p %p --dh-bits=3072 --ocsp --x509cafile=%t \
--strict-tofu --priority='SECURE192:+SECURE128:-VERS-ALL:+VERS-TLS1.2:+VERS-TLS1.3' %h"
                    ;; compatibility fallbacks
                    "gnutls-cli -p %p %h"))

(setq auth-sources (list (concat oik-private-dir "authinfo.gpg")
                         "~/.authinfo.gpg"))

(setq confirm-nonexistant-file-or-buffer nil)

(setq echo-keystrokes 0.02)

(setq ring-bell-function #'ignore
      visible-bell nil)

(setq uniquify-buffer-name-style 'forward)

(setq x-underline-at-descent-line t)

(fset #'yes-or-no-p #'y-or-n-p)

(blink-cursor-mode -1)
(setq blink-matching-paren nil)

(setq x-stretch-cursor nil)

(defvar oik-font (font-spec :family "FiraCode Nerd Font" :size 16))
(defvar oik-variable-pitch-font (font-spec :family "Noto Sans" :size 20))

(apply #'custom-set-faces
       (let ((attrs '(:weight unspecified :slant unspecified :width unspecified)))
         (append (when oik-font
                   `((fixed-pitch ((t (:font ,oik-font ,@attrs))))))
                 (when oik-variable-pitch-font
                   `((variable-pitch ((t (:font ,oik-variable-pitch-font ,@attrs)))))))))

(dolist (sym '(fixed-pitch variable-pitch))
  (put sym 'saved-face nil))

(setf (alist-get 'font default-frame-alist)
      (font-xlfd-name oik-font))

(setq indicate-buffer-boundaries nil
      indicate-empty-lines nil)

(setq display-line-numbers-width 3
      display-line-numbers-widen t
      display-line-numbers-type 'relative)

(add-hook 'prog-mode-hook #'display-line-numbers-mode)
(add-hook 'text-mode-hook #'display-line-numbers-mode)
(add-hook 'conf-mode-hook #'display-line-numbers-mode)

(setq enable-recursive-minibuffers t)

(setq resize-mini-windows 'grow-only)

(setq minibuffer-prompt-properties '(read-only t intangible t cursor-intangible t face minibuffer-prompt))
(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

(setq hscroll-margin 2
      hscroll-step 1)

(defun oik--disable-hscroll-margin-h ()
  "Set the horizontal scrolling margin to zero to prevent display glitches."
  (setq hscroll-margin 0))

(add-hook 'eshell-mode-hook #'oik--disable-hscroll-margin-h)
(add-hook 'term-mode-hook #'oik--disable-hscroll-margin-h)

(setq scroll-conservatively 101
      scroll-margin 0
      scroll-preserve-screen-position t)

(setq auto-window-vscroll nil)

(setq mouse-wheel-scroll-amount '(2 ((shift) . hscroll))
      mouse-wheel-scroll-amount-horizontal 2)

(setq frame-title-format '("%b - Oikeiôsis Emacs")
      icon-title-format frame-title-format)

(setq frame-resize-pixelwise t)

(setq window-resize-pixelwise nil)

(setq window-divider-default-places t
      window-divider-default-bottom-width 1
      window-divider-default-right-width 1)
(add-hook 'window-setup-hook #'window-divider-mode)

(setq use-dialog-box nil)
(when (bound-and-true-p tooltip-mode)
  (tooltip-mode -1))
(when oik-linux-p
  (setq x-gtk-use-system-tooltips nil))

(setq split-width-threshold 160
      split-height-threshold nil)
