tag-emacs/config/emacs/profiles/oikeiosis/README.org
** TODO Switching hooks

Switching frame, windows, and buffer are three cases where I often want to add behavior. As such, I define a system for running (and inhibiting the running of) hooks for both of those cases.

First, frames since they are the "largest". Switching frames can trigger a lot of behavior. As such, I temporarily disable garbage collection while running these hooks.

#+begin_src elisp
(defvar oik-switch-frame-hook nil
  "A list of hooks to run after changing the focused frame.")

(defvar oik-inhibit-switch-frame-hooks nil
  "A flag for indicating whether `oik-switch-frame-hook' should not run.")

(defvar oik--last-frame nil
  "A register indicating the last frame selected.

This acts as a guard to prevent frame-switching hooks from running more than
once.")

(defun oik-maybe-run-switch-frame-hooks-a ()
  "Run hooks from `oik-switch-frame-hook' unless inhibited."
  (unless (or oik-inhibit-switch-frame-hooks
              (eq oik--last-frame (selected-frame))
              (frame-parameter nil 'parent-frame))
    (let ((gc-cons-threshold most-positive-fixnum)
          (oik-inhibit-switch-frame-hooks t))
      (run-hooks 'oik-switch-frame-hooks)
      (setq oik--last-frame (selected-frame)))))
#+end_src

Next, windows. Like with frames, switching windows may trigger a lot of behavior so I disable garbage collection while running the hooks.

#+begin_src elisp
(defvar oik-switch-window-hook nil
  "A list of hooks run after changing the current window.")

(defvar oik-inhibit-switch-window-hooks nil
  "A flag for indicating whether `oik-switch-window-hook' should not run.")

(defvar oik--last-window nil
  "A register indicating the last window selected.

This acts as a guard to prevent window-switching hooks from running more than once.")

(defun oik-maybe-run-switch-window-hooks-h ()
  "Run hooks from `oik-switch-window-hook' unless inhibited."
  (unless (or oik-inhibit-switch-window-hooks
              (eq oik--last-window (selected-window))
              (minibufferp))
    (let ((gc-cons-threshold most-positive-fixnum)
          (oik-inhibit-switch-window-hooks t)
          (inhibit-redisplay t))
      (run-hooks 'oik-switch-window-hook)
      (setq oik--last-window (selected-window)))))
#+end_src

Lastly, buffers.

#+begin_src elisp
(defvar oik-switch-buffer-hook nil
  "A list of hooks run after changing the current buffer.")

(defvar oik-inhibit-switch-buffer-hooks nil
  "A flag for indicating whether `oik-switch-buffer-hook' should not run.")

(defun oik-maybe-run-switch-buffer-hooks-a (orig-fn buffer-or-name &rest args)
  ""
  (if (or oik-inhibit-switch-buffer-hooks
          (and buffer-or-name
               (eq (current-buffer) (get-buffer buffer-or-name)))
          (and (eq orig-fn #'switch-to-buffer) (car args)))
      (apply orig-fn buffer-or-name args)
    (let ((gc-cons-threshold most-positive-fixnum)
          (oik-inhibit-switch-buffer-hooks t)
          (inhibit-redisplay t))
      (when-let (buffer (apply orig-fn buffer-or-name args))
        (with-current-buffer (if (windowp buffer)
                                 (window-buffer buffer)
                               buffer)
          (run-hooks 'oik-switch-buffer-hook))
        buffer))))
#+end_src

** Initialization

Because of the likelihood of unintentional runs during initialization, I bind the setup for the UI as late as possible during startup.

#+begin_src elisp
(defun oik-init-ui-h ()
  "Initialize the user interface by apply all advice and hooks."

  (add-hook 'buffer-list-update-hook #'oik-maybe-run-switch-window-hooks-h)
  (advice-add 'after-focus-change-function :after #'oik-maybe-run-switch-frame-hooks-a)
  (dolist (fn '(switch-to-buffer display-buffer))
    (advice-add fn :around #'oik-maybe-run-switch-buffer-hooks-a)))

(add-hook 'window-setup-hook #'oik-init-ui-h 100)
#+end_src

* Editor

I don't use Emacs as an operating system, per se. I use it as a text editor. This section handles the basics for setting it up as I like a text editor to work.

For well-known file extensions, I like to apply particular modes to them even though they aren't automatically set that way by Emacs.

#+begin_src elisp
(nconc auto-mode-alist
       '(("/LICENSE\\'" . text-mode)
         ("\\.log\\'" . text-mode)
         ("rc\\'" . conf-mode)))
#+end_src

