tag-emacs/config/emacs/profiles/oikeiosis/README.org
** File handling

Backups and lock files are useful in the case that Emacs crashes, but their primary use is something that doesn't matter as much as it did in the 70s and 80s. As such, I rely on auto-save to maintain my work instead. In the off chance that something later enables backup files, I ensure that I create them in the cache directory instead of next to their files and set some sane defaults.

#+begin_src elisp
(setq create-lockfiles nil
      make-backup-files nil
      version-control t
      backup-by-copying t
      delete-old-versions t
      kept-old-versions 5
      kept-new-versions 5
      backup-directory-alist (list (cons "." (concat oik-cache-dir "backup/")))
      tramp-backup-directory-alist backup-directory-alist)
#+end_src

As stated, I use auto-save in case of crashes. Using this, I can rely on =recover-file= and =recover-session= to recover the auto-saved files.

#+begin_src elisp
(setq auto-save-default t
      auto-save-include-big-deletions t
      auto-save-list-file-prefix (concat oik-cache-dir "autosave/")
      tramp-auto-save-directory  (concat oik-cache-dir "tramp-autosave/")
      auto-save-file-name-transforms
      (list (list "\\`[^/]*:\\([^/]*/\\)*\\([^/]*\\)\\'"
                  (concat auto-save-list-file-prefix "tramp-\\2") t)
            (list ".*" auto-save-list-file-prefix t)))
#+end_src

Depending on the file system that I'm running on, long paths might be problematic. To alleviate this problem, I store my auto-save files as hashes instead of the path. I cribbed this entirely from Doom. Henrik noted that he would like to upstream this but it doesn't look like he has done that yet.

#+begin_src elisp
(defun oik-make-hashed-auto-save-file-name-a (orig-fn)
  "Compress the autosave filename so paths don't get too long."
  (let ((buffer-file-name
         (if (or (null buffer-file-name)
                 (find-file-name-handler buffer-file-name
                                         'make-auto-save-file-name))
             buffer-file-name
           (sha1 buffer-file-name))))
    (funcall orig-fn)))

(advice-add #'oik-make-hashed-auto-save-file-name-a
            :around #'make-auto-save-file-name)
#+end_src

Like with auto-save files, the default way to generate backup files can lead to paths that are too long for the file system. Since =make-backup-file-name-1= can also present this issue for packages like =undo-tree=, I advise the function to hash the path for them as well.

#+begin_src elisp
(defun oik-make-hashed-backup-file-name-a (orig-fn file)
  "Compress the backup filename so paths don't get too long."
  (let ((alist backup-directory-alist)
        backup-directory)
    (while alist
      (let ((el (pop alist)))
        (if (string-match (car el) file)
            (setq backup-directory (cdr el)
                  alist nil))))
    (let ((file (funcall orig-fn file)))
      (if (or (null backup-directory)
              (not (file-name-absolute-p backup-directory)))
          file
        (expand-file-name (sha1 (file-name-nondirectory file))
                          (file-name-directory file))))))

(advice-add #'oik-make-hashed-backup-file-name-a
            :around #'make-backup-file-name-1)
#+end_src

When working on symbolically linked files, it can lead to a jarring experience having Emacs not follow the symbolic link. These settings ensure Emacs always works from a symbolically linked file's true directory.

#+begin_src elisp
(setq find-file-visit-truename t
      vc-follow-symlinks t)
#+end_src

Because I follow symbolic links, Emacs might warn about the file being open in different ways. This is an annoying default so I disable the warning and let Emacs open the existing buffer.

#+begin_src elisp
(setq find-file-suppress-same-file-warnings t)
#+end_src

Sometimes, it's easier to define a whole non-existing path when "finding" a new file. This hook allows me to define a nested folder structure using =find-file= instead of requiring me to manually define everything

#+begin_src elisp
(defun oik-create-missing-directories-h ()
  "Automatically create missing directories when creating new files."
  (unless (file-remote-p buffer-file-name)
    (let ((parent-directory (file-name-directory buffer-file-name)))
      (and (not (file-directory-p parent-directory))
           (y-or-n-p (format "Directory `%s' does not exist! Create it?"
                             parent-directory))
           (progn (make-directory parent-directory 'parents)
                  t)))))

(add-hook 'find-file-not-found-functions
          #'oik-create-missing-directories-h)
#+end_src

After creating a file and saving it, Emacs should be able to make a guess as to the mode to run for the file. As such, I define a hook that tells Emacs to do just that.

#+begin_src elisp
(defun oik-guess-mode-h ()
  "Guess the major mode when saving a file in `fundamental-mode'.

Since you're usually only using fundamental mode upon first creation, it's
likely that Emacs will be able to guess the mode after you decide to save the
file."
  (when (eq major-mode 'fundamental-mode)
    (let ((buffer (or (buffer-base-buffer) (current-buffer))))
      (and (buffer-file-name buffer)
           (eq buffer (window-buffer (selected-window)))
           (set-auto-mode)))))

(add-hook 'after-save-hook #'oik-guess-mode-h)
#+end_src

*** Large files

Emacs can slow to a crawl when opening large files. This is partly due to the regular expression engine that powers syntax highlighting, but other features of major modes can cause slowdown as well. To protect against this, I crib Doom's behavior for handling large files by inhibiting major modes when a file exceeds a certain threshold.

#+begin_src elisp
(defvar-local oik-inhibit-large-file-detection nil
  "A buffer-local flag that indicates that large file detection should disable.")

(defvar oik-large-file-p nil
  "A predicate guard for noting whether a buffer is for a large file.")
(put 'oik-large-file-p 'permanent-local t)

(defvar oik-large-file-size-alist '(("." . 1.0))
  "An attribute list mapping regular expressions to file size thresholds.

When you open a file above a threshold for the mode, Oikei么sis performs
emergency optimizations to prevent Emacs from hanging, crashing, or becoming
unusably slow.

The thresholds are in MiB.

See `auto-mode-alist' for more information about the regular expression format.

See `oik--optimize-for-large-files-a' for the optimizations.")

(defvar oik-large-file-excluded-modes
  '(so-long-mode special-mode archive-mode tar-mode jka-compr
    git-commit-mode image-mode doc-view-mode doc-view-mode-maybe
    ebrowse-tree-mode pdf-view-mode tags-table-mode)
  "Major modes that `oik-check-large-file-h' will ignore.")

(defun oik--prepare-for-large-files-a (size _ filename &rest _)
  "Sets `oik-large-file-p' for the buffer if the file is too large.

Uses `oik-large-file-size-alist' to determine when a file is too large. When `oik-large-file-p' is non-nil, other plugins can detect this and reduce their runtime costs or disable themselves to ensure the buffer is as fast as possible."
  (and (numberp size)
       (null oik-inhibit-large-file-detection)
       (ignore-errors
         (> size
            (* 1024 1024
               (assoc-default filename oik-large-file-size-alist
                              #'string-match-p)))
         (setq-local oik-large-file-p size))))

(defun oik-optimize-for-large-files-h ()
  "Triggers `so-long-minor-mode' when the file is large."
  (when (and oik-large-file-p buffer-file-name)
    (if (or oik-inhibit-large-file-detection
            (memq major-mode doom-large-file-excluded-modes))
        (kill-local-variable 'oik-large-file-p)
      (when (fboundp 'so-long-minor-mode)
        (so-long-minor-mode +1))
      (message "Large file detected! Optimizing to improve performance."))))

(advice-add #'oik--prepare-for-large-files-a
            :before #'abort-if-file-too-large)
(add-hook 'find-file-hook #'oik-optimize-for-large-files-h)
#+end_src

** Formatting

I prefer spaces to tabs. Outside of Ruby and CSS, I like to use four of them. Set those settings as defaults so that major modes can override them when appropriate.

#+begin_src elisp
(setq-default indent-tabs-mode nil
              tab-width 4)
#+end_src

I want to allow for "real" tabs when I'm not at the beginning of a line so I disable the "always indent" behavior, but do so as a default so that major modes can override it when applicable.

#+begin_src elisp
(setq-default tab-always-indent nil)
#+end_src

I only want to tabify space at the beginning of a line, not within the line. While tabularizing data later in the line can be useful, that's a niche application and deserves its own setting.

#+begin_src elisp
(setq tabify-regexp "^\t* [ \t]+")
#+end_src

I go back and forth on the optimal fill column width. On Ruby code I like to use 110, but a general setting of 80 still makes the most sense. It allows you to easily have multiple column-wise windows and still see everything.

#+begin_src elisp
(setq-default fill-column 80)
#+end_src

I don't care for the behavior of =word-wrap= and instead rely on =visual-line-mode= when appropriate. These three settings allow me to rely on my preferred system.

#+begin_src elisp
(setq-default word-wrap t
              truncate-lines t)

(setq truncate-partial-width-windows nil)
#+end_src

I prefer the Chicago style of writing and use a single space after sentences, so Emacs should too.

#+begin_src elisp
(setq sentence-end-double-space nil)
#+end_src

Files should always have a final newline. This is partly due to POSIX standards, but can also useful in cases where you end up concatenating files together.

#+begin_src elisp
(setq require-final-newline t)
#+end_src

When writing in text modes, I like to have visual wrapping for the text, so I enable that behavior.

#+begin_src elisp
(add-hook 'text-mode-hook #'visual-line-mode)
#+end_src

