tag-emacs/config/emacs/profiles/oikeiosis/init.el

(setq create-lockfiles nil
      make-backup-files nil
      version-control t
      backup-by-copying t
      delete-old-versions t
      kept-old-versions 5
      kept-new-versions 5
      backup-directory-alist (list (cons "." (concat oik-cache-dir "backup/")))
      tramp-backup-directory-alist backup-directory-alist)

(setq auto-save-default t
      auto-save-include-big-deletions t
      auto-save-list-file-prefix (concat oik-cache-dir "autosave/")
      tramp-auto-save-directory  (concat oik-cache-dir "tramp-autosave/")
      auto-save-file-name-transforms
      (list (list "\\`[^/]*:\\([^/]*/\\)*\\([^/]*\\)\\'"
                  (concat auto-save-list-file-prefix "tramp-\\2") t)
            (list ".*" auto-save-list-file-prefix t)))

(defun oik-make-hashed-auto-save-file-name-a (orig-fn)
  "Compress the autosave filename so paths don't get too long."
  (let ((buffer-file-name
         (if (or (null buffer-file-name)
                 (find-file-name-handler buffer-file-name
                                         'make-auto-save-file-name))
             buffer-file-name
           (sha1 buffer-file-name))))
    (funcall orig-fn)))

(advice-add #'oik-make-hashed-auto-save-file-name-a
            :around #'make-auto-save-file-name)

(defun oik-make-hashed-backup-file-name-a (orig-fn file)
  "Compress the backup filename so paths don't get too long."
  (let ((alist backup-directory-alist)
        backup-directory)
    (while alist
      (let ((el (pop alist)))
        (if (string-match (car el) file)
            (setq backup-directory (cdr el)
                  alist nil))))
    (let ((file (funcall orig-fn file)))
      (if (or (null backup-directory)
              (not (file-name-absolute-p backup-directory)))
          file
        (expand-file-name (sha1 (file-name-nondirectory file))
                          (file-name-directory file))))))

(advice-add #'oik-make-hashed-backup-file-name-a
            :around #'make-backup-file-name-1)

(setq find-file-visit-truename t
      vc-follow-symlinks t)

(setq find-file-suppress-same-file-warnings t)

(defun oik-create-missing-directories-h ()
  "Automatically create missing directories when creating new files."
  (unless (file-remote-p buffer-file-name)
    (let ((parent-directory (file-name-directory buffer-file-name)))
      (and (not (file-directory-p parent-directory))
           (y-or-n-p (format "Directory `%s' does not exist! Create it?"
                             parent-directory))
           (progn (make-directory parent-directory 'parents)
                  t)))))

(add-hook 'find-file-not-found-functions
          #'oik-create-missing-directories-h)

(defun oik-guess-mode-h ()
  "Guess the major mode when saving a file in `fundamental-mode'.

Since you're usually only using fundamental mode upon first creation, it's
likely that Emacs will be able to guess the mode after you decide to save the
file."
  (when (eq major-mode 'fundamental-mode)
    (let ((buffer (or (buffer-base-buffer) (current-buffer))))
      (and (buffer-file-name buffer)
           (eq buffer (window-buffer (selected-window)))
           (set-auto-mode)))))

(add-hook 'after-save-hook #'oik-guess-mode-h)

(defvar-local oik-inhibit-large-file-detection nil
  "A buffer-local flag that indicates that large file detection should disable.")

(defvar oik-large-file-p nil
  "A predicate guard for noting whether a buffer is for a large file.")
(put 'oik-large-file-p 'permanent-local t)

(defvar oik-large-file-size-alist '(("." . 1.0))
  "An attribute list mapping regular expressions to file size thresholds.

When you open a file above a threshold for the mode, Oikeiôsis performs
emergency optimizations to prevent Emacs from hanging, crashing, or becoming
unusably slow.

The thresholds are in MiB.

See `auto-mode-alist' for more information about the regular expression format.

See `oik--optimize-for-large-files-a' for the optimizations.")

(defvar oik-large-file-excluded-modes
  '(so-long-mode special-mode archive-mode tar-mode jka-compr
    git-commit-mode image-mode doc-view-mode doc-view-mode-maybe
    ebrowse-tree-mode pdf-view-mode tags-table-mode)
  "Major modes that `oik-check-large-file-h' will ignore.")

(defun oik--prepare-for-large-files-a (size _ filename &rest _)
  "Sets `oik-large-file-p' for the buffer if the file is too large.

Uses `oik-large-file-size-alist' to determine when a file is too large. When `oik-large-file-p' is non-nil, other plugins can detect this and reduce their runtime costs or disable themselves to ensure the buffer is as fast as possible."
  (and (numberp size)
       (null oik-inhibit-large-file-detection)
       (ignore-errors
         (> size
            (* 1024 1024
               (assoc-default filename oik-large-file-size-alist
                              #'string-match-p)))
         (setq-local oik-large-file-p size))))

(defun oik-optimize-for-large-files-h ()
  "Triggers `so-long-minor-mode' when the file is large."
  (when (and oik-large-file-p buffer-file-name)
    (if (or oik-inhibit-large-file-detection
            (memq major-mode doom-large-file-excluded-modes))
        (kill-local-variable 'oik-large-file-p)
      (when (fboundp 'so-long-minor-mode)
        (so-long-minor-mode +1))
      (message "Large file detected! Optimizing to improve performance."))))

(advice-add #'oik--prepare-for-large-files-a
            :before #'abort-if-file-too-large)
(add-hook 'find-file-hook #'oik-optimize-for-large-files-h)

(setq-default indent-tabs-mode nil
              tab-width 4)

(setq-default tab-always-indent nil)

(setq tabify-regexp "^\t* [ \t]+")

(setq-default fill-column 80)

(setq-default word-wrap t
              truncate-lines t)

(setq truncate-partial-width-windows nil)

(setq sentence-end-double-space nil)

(setq require-final-newline t)

(add-hook 'text-mode-hook #'visual-line-mode)
