tag-emacs/config/emacs/profiles/oikeiosis/README.org
** Clipboard

When using Evil, you can easily end up with duplicates in your clipboard which makes it harder to use. So I don't allow duplicates in it.

#+begin_src elisp
(setq kill-do-not-save-duplicates t)
#+end_src

Rich text and UTF are both useful to allow so I enable them even in the terminal (although this only applies to X so I don't know whether it applies at all anymore).

#+begin_src elisp
(when oik-linux-p
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
#+end_src

* Package management

I use [[https://github.com/progfolio/elpaca][Elpaca]] for package management instead of the built-in package manager. These values set up some configuration that I like.

#+begin_src elisp
(setq package-enable-at-startup nil)

(defvar elpaca-base-dir (expand-file-name "elpaca/" oik-data-dir))
(defvar elpaca-builds-dir (expand-file-name (format "build-%s" emacs-version) elpaca-base-dir))
(defvar elpaca-repos-dir (expand-file-name "repos/" elpaca-base-dir))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
#+end_src

Install and configure Elpaca.

#+begin_src elisp
(defvar elpaca-installer-version 0.6)

(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-dir))
       (build (expand-file-name "elpaca/" elpaca-builds-dir))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((bootstrap-buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (call-process "git" nil bootstrap-buffer t "clone"
                                       (plist-get order :repo) repo)))
                 ((zerop (call-process "git" nil bootstrap-buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil bootstrap-buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer bootstrap-buffer))
          (error "%s" (with-current-buffer bootstrap-buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
#+end_src

** Core packages

Install =use-package= first so that we can use Elpaca via the nicer macro. I assume =:elpaca= unless otherwise stated.

#+begin_src elisp
(elpaca elpaca-use-package
  (elpaca-use-package-mode)
  (setq elpaca-use-package-by-default t))
#+end_src

To allow for the reset of the setup to continue, I install the =use-package= integration up front.

#+begin_src elisp
(elpaca-wait)
#+end_src

*** gcmh

- links :: [[https://melpa.org/#/gcmh][melpa]], [[https://gitlab.com/koral/gcmh][source]]

To automatically manage the Emacs garbage collector, I rely on the Garbage Collector Magic Hack. It attempts to limit garbage collection to when Emacs is idle in order to prevent the garbage collector from interfering with input.

#+begin_src elisp
(use-package gcmh
  :config
  (setq gcmh-idle-delay 5
        gcmh-high-cons-threshold (* 16 1024 1024) ; 16 MiB
        gcmh-verbose oik-debug-p)
  (gcmh-mode +1))
#+end_src

*** general.el

- links :: [[https://melpa.org/#/general][melpa]], [[https://github.com/noctuid/general.el][source]]

Keybinding in Emacs can be challenging. To make it easier, I use the =general= package which makes binding leader-key commands easier.

#+begin_src elisp
(use-package general)

(elpaca-wait)
#+end_src

*** evil

- links :: [[https://melpa.org/#/evil][melpa]], [[https://github.com/emacs-evil/evil][source]]

I used Vim for many years and came to appreciate the way you can use normal mode for navigating and modifying your code. As such, I am an =evil= user.

#+begin_src elisp
(use-package evil
  :init
  (setq evil-want-integration t
        evil-want-keybinding nil
        evil-want-C-u-scroll t
        evil-want-C-i-jump t
        evil-respect-visual-line-mode t)
  :config
  (general-evil-setup)
  (evil-mode +1)
  (general-def 'motion
    "j" 'evil-next-visual-line
    "k" 'evil-previous-visual-line)

  (general-nmap :keymaps 'process-menu-mode-map
    "q" #'kill-current-buffer
    "d" #'process-menu-delete-process)

  (defun oik-map-read-only-mode (map)
    "Unmap insertion keys from Evil's normal state."

    (general-nmap :keymaps map
      [remap evil-append-line]          #'ignore
      [remap evil-append]               #'ignore
      [remap evil-change-line]          #'ignore
      [remap evil-change-whole-line]    #'ignore
      [remap evil-change]               #'ignore
      [remap evil-delete-backward-char] #'ignore
      [remap evil-delete-char]          #'ignore
      [remap evil-delete-line]          #'ignore
      [remap evil-delete]               #'ignore
      [remap evil-indent]               #'ignore
      [remap evil-insert-line]          #'ignore
      [remap evil-insert]               #'ignore
      [remap evil-invert-char]          #'ignore
      [remap evil-join]                 #'ignore
      [remap evil-open-above]           #'ignore
      [remap evil-open-below]           #'ignore
      [remap evil-paste-after]          #'ignore
      [remap evil-paste-before]         #'ignore
      [remap evil-replace-state]        #'ignore
      [remap evil-replace]              #'ignore
      [remap evil-shift-left]           #'ignore
      [remap evil-shift-right]          #'ignore
      [remap evil-substitute]           #'ignore
      "q"                               #'quit-window
      "ZZ"                              #'quit-window
      "ZQ"                              #'evil-quit)))
#+end_src

*** helpful

- links :: [[https://melpa.org/#/helpful][melpa]], [[https://github.com/Wilfred/helpful][source]]

Emacs is a discoverable editor but it needs help making sure things are truly discoverable. To aid in this quest, I use =helpful= for showing documentation. I remap every binding to the built-in describe functions to use these more --- ahem --- helpful versions.

I also configure =apropos= here upon load to use =helpful= functions instead of the built-in describe functions.

#+begin_src elisp
(use-package helpful
  :commands helpful--read-symbol
  :bind
  ([remap describe-command] . helpful-command)
  ([remap describe-function] . helpful-callable)
  ([remap describe-key] . helpful-key)
  ([remap describe-symbol] . helpful-symbol)
  ([remap describe-variable] . helpful-variable)
  :general
  (helpful-mode-map
   "<tab>" #'forward-button
   "<backtab>" #'backward-button
   "RET" #'helpful-visit-reference
   (general-nmap :keymaps 'helpful-mode-map
     "q" #'quit-window
     "ZZ" #'quit-window
     "ZQ" #'evil-quit)
   )
  :init
  (setq apropos-do-all t)

  (oik-map-read-only-mode 'helpful-mode-map)

  (general-with-eval-after-load 'apropos
    (dolist (fun-btn '(apropos-function apropos-macro apropos-command))
      (button-type-put
       fun-btn 'action
       (lambda (button)
         (helpful-callable (button-get button 'apropos-symbol)))))

    (dolist (var-btn '(apropos-variable apropos-user-option))
      (button-type-put
       var-btn 'action
       (lambda (button)
         (helpful-variable (button-get button 'apropos-symbol)))))))
#+end_src

*** which-key

- links :: [[https://melpa.org/#/which-key][melpa]], [[https://github.com/justbur/emacs-which-key][source]]

=which-key= is helpful for discovering what command a particular key sequence calls.

#+begin_src elisp
(use-package which-key
  :init
  (which-key-mode +1))
#+end_src

*** explain-pause

- links :: [[https://github.com/lastquestion/explain-pause-mode][source]]

Debugging pauses in Emacs can be frustrating. In order to make it a little easier, =explain-pause-mode= gives you an experience similar to =top= to find the culprits of a pause.

#+begin_src elisp
(use-package explain-pause-mode
  :elpaca (explain-pause-mode
           :type git
           :host github
           :repo "lastquestion/explain-pause-mode"))
#+end_src

** Built-in packages

Emacs continues to include packages in its core with each new version. This section configures packages that are now built into Emacs.

*** ansi-color

- links :: built-in

=ansi-color= adds support for ANSI-compatible color codes, which are useful for shell buffers and compilation buffers. This setting enables compilation buffers to render these ANSI-compatible codes.

#+begin_src elisp
(setq ansi-color-for-comint-mode t)
#+end_src

