tag-emacs/config/emacs/profiles/oikeiosis/init.el

(setq kill-do-not-save-duplicates t)

(when oik-linux-p
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))

(setq package-enable-at-startup nil)

(defvar elpaca-base-dir (expand-file-name "elpaca/" oik-data-dir))
(defvar elpaca-builds-dir (expand-file-name (format "build-%s" emacs-version) elpaca-base-dir))
(defvar elpaca-repos-dir (expand-file-name "repos/" elpaca-base-dir))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))

(defvar elpaca-installer-version 0.6)

(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-dir))
       (build (expand-file-name "elpaca/" elpaca-builds-dir))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((bootstrap-buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (call-process "git" nil bootstrap-buffer t "clone"
                                       (plist-get order :repo) repo)))
                 ((zerop (call-process "git" nil bootstrap-buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil bootstrap-buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer bootstrap-buffer))
          (error "%s" (with-current-buffer bootstrap-buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

(elpaca elpaca-use-package
  (elpaca-use-package-mode)
  (setq elpaca-use-package-by-default t))

(elpaca-wait)

(use-package gcmh
  :config
  (setq gcmh-idle-delay 5
        gcmh-high-cons-threshold (* 16 1024 1024) ; 16 MiB
        gcmh-verbose oik-debug-p)
  (gcmh-mode +1))

(use-package general)

(elpaca-wait)

(use-package evil
  :init
  (setq evil-want-integration t
        evil-want-keybinding nil
        evil-want-C-u-scroll t
        evil-want-C-i-jump t
        evil-respect-visual-line-mode t)
  :config
  (general-evil-setup)
  (evil-mode +1)
  (general-def 'motion
    "j" 'evil-next-visual-line
    "k" 'evil-previous-visual-line)

  (general-nmap :keymaps 'process-menu-mode-map
    "q" #'kill-current-buffer
    "d" #'process-menu-delete-process)

  (defun oik-map-read-only-mode (map)
    "Unmap insertion keys from Evil's normal state."

    (general-nmap :keymaps map
      [remap evil-append-line]          #'ignore
      [remap evil-append]               #'ignore
      [remap evil-change-line]          #'ignore
      [remap evil-change-whole-line]    #'ignore
      [remap evil-change]               #'ignore
      [remap evil-delete-backward-char] #'ignore
      [remap evil-delete-char]          #'ignore
      [remap evil-delete-line]          #'ignore
      [remap evil-delete]               #'ignore
      [remap evil-indent]               #'ignore
      [remap evil-insert-line]          #'ignore
      [remap evil-insert]               #'ignore
      [remap evil-invert-char]          #'ignore
      [remap evil-join]                 #'ignore
      [remap evil-open-above]           #'ignore
      [remap evil-open-below]           #'ignore
      [remap evil-paste-after]          #'ignore
      [remap evil-paste-before]         #'ignore
      [remap evil-replace-state]        #'ignore
      [remap evil-replace]              #'ignore
      [remap evil-shift-left]           #'ignore
      [remap evil-shift-right]          #'ignore
      [remap evil-substitute]           #'ignore
      "q"                               #'quit-window
      "ZZ"                              #'quit-window
      "ZQ"                              #'evil-quit)))

(use-package helpful
  :commands helpful--read-symbol
  :bind
  ([remap describe-command] . helpful-command)
  ([remap describe-function] . helpful-callable)
  ([remap describe-key] . helpful-key)
  ([remap describe-symbol] . helpful-symbol)
  ([remap describe-variable] . helpful-variable)
  :general
  (helpful-mode-map
   "<tab>" #'forward-button
   "<backtab>" #'backward-button
   "RET" #'helpful-visit-reference
   (general-nmap :keymaps 'helpful-mode-map
     "q" #'quit-window
     "ZZ" #'quit-window
     "ZQ" #'evil-quit)
   )
  :init
  (setq apropos-do-all t)

  (oik-map-read-only-mode 'helpful-mode-map)

  (general-with-eval-after-load 'apropos
    (dolist (fun-btn '(apropos-function apropos-macro apropos-command))
      (button-type-put
       fun-btn 'action
       (lambda (button)
         (helpful-callable (button-get button 'apropos-symbol)))))

    (dolist (var-btn '(apropos-variable apropos-user-option))
      (button-type-put
       var-btn 'action
       (lambda (button)
         (helpful-variable (button-get button 'apropos-symbol)))))))

(use-package which-key
  :init
  (which-key-mode +1))

(use-package explain-pause-mode
  :elpaca (explain-pause-mode
           :type git
           :host github
           :repo "lastquestion/explain-pause-mode"))

(setq ansi-color-for-comint-mode t)
