tag-emacs/config/emacs/profiles/oikeiosis/README.org
*** autorevert

- links :: built-in

The =autorevert= package is useful because it helps when other programs edit files that Emacs has open. However, its default behavior uses expensive file watchers or polling so I don't like to rely on the default behavior. Instead, I cribbed this behavior from Doom:

1. When your focus leaves Emacs and you come back to it, attempt to auto-revert all visible buffers.
2. When saving, attempt to auto-revert all visible buffers in case saving one file changes another.
3. When switching buffers, make sure nothing modified the one you're switching to.
4. When switching windows, makes sure nothing modified the buffer you're switching to.

This approach is much lighter than filesystem watchers and covers /most/ cases where something might modify a file without Emacs knowing.

#+begin_src elisp
(defun oik-visible-buffers ()
  "Return a list of visible, non-buried buffers."
  (delete-dups (mapcar #'window-buffer (window-list))))

(use-package autorevert
  :elpaca nil
  :hook (focus-in . oik-auto-revert-buffers-h)
  :hook (after-save . oik-auto-revert-buffers-h)
  :hook (oik-switch-buffer . oik-auto-revert-buffer-h)
  :hook (oik-switch-window . oik-auto-revert-buffer-h)
  :config
  (setq auto-revert-verbose t
        auto-revert-use-notify nil
        auto-revert-stop-on-user-input nil
        revert-without-query (list "."))

  (defun oik-auto-revert-buffer-h ()
    "Automatically reverts the current buffer, if necessary."
    (unless (or auto-revert-mode (active-minibuffer-window))
      (let ((auto-revert-mode t))
        (auto-revert-handler)))))

  (defun oik-auto-revert-buffers-h ()
    "Automatically reverts stale buffers in visible windows, if necessary."
    (dolist (buffer (oik-visible-buffers))
      (with-current-buffer buffer
        (oik-auto-revert-buffer-h))))
#+end_src

*** comint

- links :: built-in

=comint= is a mode for "command interpolation" such as compiling programs and programming shells. For the shells, they each have their own major mode but when running compilation commands, I don't want to try to modify the output so I set it read-only. I also double the default size of the scrollback buffer to make sure I can gain context when compilation fails.

#+begin_src elisp
(general-with-eval-after-load 'comint
  (setq comint-prompt-read-only t
        comint-buffer-maximum-size 2048))
#+end_src

*** compile

- links :: built-in

=compile= is the actual package that performs program compilation and uses =comint= for display. To make it more usable, I kill any other versions of the same compilation when one starts, save all open buffers when starting a compilation, and automatically scroll the buffer to the first error when there is one. I also allow for ANSI color codes in the compilation buffer and truncate it to the maximum size to prevent compilations from using too many resources.

#+begin_src elisp
(general-with-eval-after-load 'compile
  (setq compilation-always-kill t
        compilation-ask-about-save nil
        compilation-scroll-output 'first-error)

  ;;;###autoload
  (defun oik-use-ansi-colors-in-compilation-buffer-h ()
    "Applies ANSI color codes to compilation buffers to make them more readable. Meant for `compilation-filter-hook'."
    (with-silent-modifications
      (ansi-color-apply-on-region compilation-filter-start (point))))

  (general-add-hook 'compilation-filter-hook
                    #'oik-use-ansi-colors-in-compilation-buffer-h)
  (autoload 'comint-truncate-buffer "comint" nil t)
  (general-add-hook 'compilation-filter-hook
                    #'comint-truncate-buffer))
#+end_src

*** ediff

- links :: built-in

=ediff= is a great package for reading and applying differences between files. To make the diff less noisy, I ignore whitespace in it. I also like to look at the diff in full frame, so I set up the windowing to only open the two files and the combination, with the diffing files across from each other.

To make diffing unobtrusive, I also save and restore the window configuration when diffing. This means that I can jump right back to what I was doing prior to the diff.

#+begin_src elisp
(general-with-eval-after-load 'ediff
  (setq ediff-diff-options "-w"
        ediff-split-window-function #'split-window-horizontally
        ediff-window-setup-function #'ediff-setup-windows-plain)

  (defvar oik--ediff-saved-wconf nil
    "Stores the window configuration from prior to diffing.")

  (defun oik--ediff-save-wconf-h ()
    "Saves the current window configuration to restore after diffing."
    (setq oik--ediff-saved-wconf (current-window-configuration)))

  (defun oik--ediff-restore-wconf-h ()
    "Restores the window configuration from prior to diffing."
    (when (window-configuration-p oik--ediff-saved-wconf)
      (set-window-configuration oik--ediff-saved-wconf)
      (setq oik--ediff-saved-wconf nil)))

  (general-add-hook 'ediff-before-setup-hook #'oik--ediff-save-wconf-h)
  (general-add-hook '(ediff-quit-hook ediff-suspend-hook)
                    #'oik--ediff-restore-wconf-h))
#+end_src

*** hl-line

- links :: built-in

=hl-line= is a package that helps to identify where your cursor is in a buffer. By default, the highlight applies in all buffers, regardless of mode. However, there are modes where it makes little to no sense to highlight the line. As such, I hack the global mode so that it:

1. only applies in a whitelisted family of modes
2. automatically disables and re-enables when entering specific modes like visual selection and mark mode

#+begin_src elisp
(use-package hl-line
  :elpaca nil
  :hook (window-setup . global-hl-line-mode)
  :init
  (defvar global-hl-line-modes
    '(prog-mode text-mode conf-mode special-mode org-agenda-mode)
    "The modes to enable `hl-line-mode' in.")
  :config
  (define-globalized-minor-mode global-hl-line-mode hl-line-mode
    (lambda ()
      (and (cond (hl-line-mode nil)
                 ((null global-hl-line-modes) nil)
                 ((eq global-hl-line-modes t))
                 ((eq (car global-hl-line-modes) 'not)
                  (not (derived-mode-p global-hl-line-modes)))
                 ((apply #'derived-mode-p global-hl-line-modes)))
           (hl-line-mode +1))))

  (defvar oik--hl-line-mode nil
    "The memoized state of manual `hl-line-mode' deactivation.")

  (defun oik-mark-hl-line-as-disabled-h ()
    "Saves when `hl-line-mode' is disabled upon entering it."
    (unless hl-line-mode
      (setq-local oik--hl-line-mode nil)))

  (defun oik-disable-hl-line-h ()
    "Temporarily disables `hl-line-mode' for specific modes."
    (when hl-line-mode
      (hl-line-mode -1)
      (setq-local oik--hl-line-mode t)))

  (defun oik-enable-hl-line-maybe-h ()
    "Reenables `hl-line-mode' when it was temporarily disabled via a hook."
    (when oik--hl-line-mode
      (hl-line-mode +1)))

  (general-add-hook 'hl-line-mode-hook #'oik-mark-hl-line-as-disabled-h)
  (general-add-hook '(evil-visual-state-entry-hook activate-mark-hook)
                    #'oik-disable-hl-line-h)
  (general-add-hook '(evil-visual-state-exit-hook deactivate-mark-hook)
                    #'oik-enable-hl-line-maybe-h))
#+end_src

*** paren

- links :: built-in

=paren= is a package that highlights the matching delimeter for the current point. It makes it easier for me to visually check, in particular, Lisp parenthesis pairs when writing Emacs configuration. I configure the package so that the matches will be maximally shown when I'm working around a pair and set it so Emacs shows them quickly upon pausing upon a point.

#+begin_src elisp
(use-package paren
  :elpaca nil
  :hook (window-setup . show-paren-mode)
  :config
  (setq show-paren-delay 0.1
        show-paren-highlight-openparen t
        show-paren-when-point-inside-paren t
        show-paren-when-point-in-periphery t))
#+end_src

*** whitespace

- links :: built-in

=whitespace= is a package for visualizing whitespace in your buffers. This is useful for seeing when whitespace is wrong within a file and for double-checking the real characters when working in a new project. I currently do not show a fill-line because I find it distracting. When I want to see whitespace, I want to see /all/ of it, so I enable all styles. I also use unicode characters for visualizing different pieces of whitespace when they are available.

#+begin_src elisp
(setq whitespace-line-column nil
      whitespace-style
      '(face indentation tabs tab-mark spaces space-mark newline newline-mark
        trailing lines-tail)
      whitespace-display-mappings
      '((tab-mark ?\t [? ?\t])
        (newline-mark ?\n [?卢 ?\n])
        (space-mark ?\  [?路] [?.])))
#+end_src

*** winner

- links :: built-in

=winner= is a package that allows you to  easily undo and redo changes to Emacs' window layout. It automatically binds keys with keys that do not work well for keeping your hands on the home row so I disable the auto-binding. I also mark some extra buffers as "boring" to Winner to make sure it never restores them.

#+begin_src elisp
(use-package winner
  :elpaca nil
  :preface (defvar winner-dont-bind-my-keys t)
  :hook (window-setup . winner-mode)
  :config
  (setq winner-boring-buffers
        (append winner-boring-buffers "*Apropos*" "*Buffer List*"
                "*Compile-Log*")))
#+end_src

** User interface

Being a long-running computer program in which I spend much of my day, I deeply care about the user interface and experience for my Emacs. This section contains the configuration for the user interface of the editor.

*** Look and feel

Visual aesthetics are a common point of customization in text editors. I prefer a minimal look and feel, so you won't find much in here in the way of bells and whistles.

**** apropospriate-theme

- links :: [[https://melpa.org/#/apropospriate-theme][melpa]], [[https://github.com/waymondo/apropospriate-theme][source]]

I currently use the =apropospriate-theme= in both dark and light variants, depending on the environment that I'm in. It mostly works for me, but I find some of the color choices in specific circumstances are wearing on me so I am considering a new theme. I haven't found any contenders as of yet.

I have [[*Theme-specific][some Org-specific customizations]] later in the document.

#+begin_src elisp
(use-package apropospriate-theme
  :config
  (load-theme 'apropospriate-dark t)
  (load-theme 'apropospriate-light t t))
#+end_src

** Completion system

