tag-emacs/config/emacs/profiles/oikeiosis/init.el

(defun oik-visible-buffers ()
  "Return a list of visible, non-buried buffers."
  (delete-dups (mapcar #'window-buffer (window-list))))

(use-package autorevert
  :elpaca nil
  :hook (focus-in . oik-auto-revert-buffers-h)
  :hook (after-save . oik-auto-revert-buffers-h)
  :hook (oik-switch-buffer . oik-auto-revert-buffer-h)
  :hook (oik-switch-window . oik-auto-revert-buffer-h)
  :config
  (setq auto-revert-verbose t
        auto-revert-use-notify nil
        auto-revert-stop-on-user-input nil
        revert-without-query (list "."))

  (defun oik-auto-revert-buffer-h ()
    "Automatically reverts the current buffer, if necessary."
    (unless (or auto-revert-mode (active-minibuffer-window))
      (let ((auto-revert-mode t))
        (auto-revert-handler)))))

  (defun oik-auto-revert-buffers-h ()
    "Automatically reverts stale buffers in visible windows, if necessary."
    (dolist (buffer (oik-visible-buffers))
      (with-current-buffer buffer
        (oik-auto-revert-buffer-h))))

(general-with-eval-after-load 'comint
  (setq comint-prompt-read-only t
        comint-buffer-maximum-size 2048))

(general-with-eval-after-load 'compile
  (setq compilation-always-kill t
        compilation-ask-about-save nil
        compilation-scroll-output 'first-error)

  ;;;###autoload
  (defun oik-use-ansi-colors-in-compilation-buffer-h ()
    "Applies ANSI color codes to compilation buffers to make them more readable. Meant for `compilation-filter-hook'."
    (with-silent-modifications
      (ansi-color-apply-on-region compilation-filter-start (point))))

  (general-add-hook 'compilation-filter-hook
                    #'oik-use-ansi-colors-in-compilation-buffer-h)
  (autoload 'comint-truncate-buffer "comint" nil t)
  (general-add-hook 'compilation-filter-hook
                    #'comint-truncate-buffer))

(general-with-eval-after-load 'ediff
  (setq ediff-diff-options "-w"
        ediff-split-window-function #'split-window-horizontally
        ediff-window-setup-function #'ediff-setup-windows-plain)

  (defvar oik--ediff-saved-wconf nil
    "Stores the window configuration from prior to diffing.")

  (defun oik--ediff-save-wconf-h ()
    "Saves the current window configuration to restore after diffing."
    (setq oik--ediff-saved-wconf (current-window-configuration)))

  (defun oik--ediff-restore-wconf-h ()
    "Restores the window configuration from prior to diffing."
    (when (window-configuration-p oik--ediff-saved-wconf)
      (set-window-configuration oik--ediff-saved-wconf)
      (setq oik--ediff-saved-wconf nil)))

  (general-add-hook 'ediff-before-setup-hook #'oik--ediff-save-wconf-h)
  (general-add-hook '(ediff-quit-hook ediff-suspend-hook)
                    #'oik--ediff-restore-wconf-h))

(use-package hl-line
  :elpaca nil
  :hook (window-setup . global-hl-line-mode)
  :init
  (defvar global-hl-line-modes
    '(prog-mode text-mode conf-mode special-mode org-agenda-mode)
    "The modes to enable `hl-line-mode' in.")
  :config
  (define-globalized-minor-mode global-hl-line-mode hl-line-mode
    (lambda ()
      (and (cond (hl-line-mode nil)
                 ((null global-hl-line-modes) nil)
                 ((eq global-hl-line-modes t))
                 ((eq (car global-hl-line-modes) 'not)
                  (not (derived-mode-p global-hl-line-modes)))
                 ((apply #'derived-mode-p global-hl-line-modes)))
           (hl-line-mode +1))))

  (defvar oik--hl-line-mode nil
    "The memoized state of manual `hl-line-mode' deactivation.")

  (defun oik-mark-hl-line-as-disabled-h ()
    "Saves when `hl-line-mode' is disabled upon entering it."
    (unless hl-line-mode
      (setq-local oik--hl-line-mode nil)))

  (defun oik-disable-hl-line-h ()
    "Temporarily disables `hl-line-mode' for specific modes."
    (when hl-line-mode
      (hl-line-mode -1)
      (setq-local oik--hl-line-mode t)))

  (defun oik-enable-hl-line-maybe-h ()
    "Reenables `hl-line-mode' when it was temporarily disabled via a hook."
    (when oik--hl-line-mode
      (hl-line-mode +1)))

  (general-add-hook 'hl-line-mode-hook #'oik-mark-hl-line-as-disabled-h)
  (general-add-hook '(evil-visual-state-entry-hook activate-mark-hook)
                    #'oik-disable-hl-line-h)
  (general-add-hook '(evil-visual-state-exit-hook deactivate-mark-hook)
                    #'oik-enable-hl-line-maybe-h))

(use-package paren
  :elpaca nil
  :hook (window-setup . show-paren-mode)
  :config
  (setq show-paren-delay 0.1
        show-paren-highlight-openparen t
        show-paren-when-point-inside-paren t
        show-paren-when-point-in-periphery t))

(setq whitespace-line-column nil
      whitespace-style
      '(face indentation tabs tab-mark spaces space-mark newline newline-mark
        trailing lines-tail)
      whitespace-display-mappings
      '((tab-mark ?\t [?› ?\t])
        (newline-mark ?\n [?¬ ?\n])
        (space-mark ?\  [?·] [?.])))

(use-package winner
  :elpaca nil
  :preface (defvar winner-dont-bind-my-keys t)
  :hook (window-setup . winner-mode)
  :config
  (setq winner-boring-buffers
        (append winner-boring-buffers "*Apropos*" "*Buffer List*"
                "*Compile-Log*")))

(use-package apropospriate-theme
  :config
  (load-theme 'apropospriate-dark t)
  (load-theme 'apropospriate-light t t))
