tag-emacs/config/emacs/profiles/oikeiosis/init.el

(use-package consult
  :bind
  ([remap apropos] . consult-apropos)
  ([remap bookmark-jump] . consult-bookmark)
  ([remap evil-show-marks] . consult-mark)
  ([remap goto-line] . consult-goto-line)
  ([remap imenu] . consult-imenu)
  ([remap isearch-backward] . consult-line)
  ([remap isearch-forward] . consult-line)
  ([remap locate] . consult-locate)
  ([remap load-theme] . consult-theme)
  ([remap man] . consult-man)
  ([remap recentf-open-file] . consult-recent-file)
  ([remap switch-to-buffer] . consult-buffer)
  ([remap switch-to-buffer-other-window] . consult-buffer-other-window)
  ([remap switch-to-buffer-other-frame] . consult-buffer-other-frame)
  ([remap yank-pop] . consult-yank-pop)
  :init
  (advice-add #'completing-read-multiple :override #'consult-completing-read-multiple)
  (advice-add #'multi-occur :override #'consult-multi-occur)
  :config
  (setq consult-narrow-key "<"
        consult-line-numbers-widen t
        consult-async-min-input 2
        consult-async-refresh-delay 0.15
        consult-async-input-throttle 0.2
        consult-async-input-debounce 0.1)
  (consult-customize
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file consult-xref
   consult--source-bookmark consult--source-file-register
   consult--source-recent-file consult--source-project-recent-file
   :preview-key (list (kbd "C-SPC") (kbd "C-M-j") (kbd "C-M-k"))))

(use-package marginalia
  :after vertico
  :general
  (minibuffer-local-map
   "M-A" #'marginalia-cycle)
  :init
  (marginalia-mode +1))

(use-package orderless
  :config
  (defun oik-orderless-dispatch (pattern _index _total)
    "Configure an `orderless' query via prefixes and suffixes.

A PATTERN ending in '$' will still work with a Consult command even though it
adds disambiguation suffixes.

A PATTERN beginning in '!' negates it in the search.

A PATTERN beginning in '`' makes a search only find in-order initials, e.g. abc
maps to \\<a.*\\<b.*\\c. Useful for searches like 'ffap'.

A PATTERN beginning in '=' quotes it as a literal.

A PATTERN beginning in '~' matches those characters in strict order, e.g. abc
maps to a.*b.*c."
    (cond
     ((string-suffix-p "$" pattern)
      `(orderless-regexp . ,(concat (substring pattern 0 -1) "[\x100000-\x10FFFD]*$")))
     ((string= "!" pattern) `(orderless-literal . ""))
     ((string-prefix-p "!" pattern) `(orderless-without-literal . ,(substring pattern 1)))
     ((string-prefix-p "`" pattern) `(orderless-initialism . ,(substring pattern 1)))
     ((string-prefix-p "=" pattern) `(orderless-literal . ,(substring pattern 1)))
     ((string-prefix-p "~" pattern) `(orderless-flex . ,(substring pattern 1)))))

  (setq completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '((file (styles . (orderless partial-completion))))
        orderless-style-dispatchers '(oik-orderless-dispatch)))

(use-package savehist
  :elpaca nil
  :custom (savehist-file (concat oik-cache-dir "savehist"))
  :config
  (setq savehist-save-minibuffer-history t
        savehist-autosave-interval nil
        savehist-additional-variables
        '(kill-ring
          register-alist
          mark-ring global-mark-ring
          search-ring regexp-search-ring))

  (defun oik-savehist-unpropertize-variables-h ()
    "Remove text properties from `kill-ring' to reduce savehist cache size."
    (setq kill-ring
          (mapcar #'substring-no-properties
                  (cl-remove-if-not #'stringp kill-ring))
          register-alist
          (cl-loop for (reg . item) in register-alist
                   if (stringp item)
                   collect (cons reg (substring-no-properties item))
                   else collect (cons reg item))))

  (defun oik-savehist-remove-unprintable-registers-h ()
    "Remove unprintable registers (e.g. containing window configurations) from savehist.

This allows it to save the rest of `register-alist' instead of discarding the whole."
    (setq-local register-alist
                (cl-remove-if-not #'savehist-printable register-alist)))

  (general-add-hook 'savehist-save-hook
                    '(oik-savehist-unpropertize-variables-h
                      oik-savehist-remove-unprintable-registers-h))

  (savehist-mode +1))

(use-package vertico
  :general
  (vertico-map
   "C-j"   #'vertico-next
   "C-S-j" #'vertico-next-group
   "C-k"   #'vertico-previous
   "C-S-k" #'vertico-previous-group
   "M-RET" #'vertico-exit-input)
  (minibuffer-local-map
   "M-h" #'backward-kill-word)
  :init
  (vertico-mode +1)
  :config
  (setq vertico-cycle t
        completion-in-region-function
        (lambda (&rest args)
          (cond (vertico-mode (apply #'consult-completion-in-region args))
                (t (apply #'completion--in-region args))))))

;; (use-package smartparens
;;   :hook (prog-mode org-mode)
;;   :commands (sp-pair
;;              sp-local-pair
;;              sp-with-modes
;;              sp-point-in-comment
;;              sp-point-in-string)
;;   :config
;;   ;; Disable overlays because they are expensive and not as useful with evil
;;   (setq sp-highlight-pair-overlay nil
;;         sp-highlight-wrap-overlay nil
;;         sp-highlight-wrap-tag-overlay nil)
;; 
;;   ;; Tweak some settings for performance
;;   (setq sp-max-prefix-length 25
;;         sp-max-pair-length 4)
;; 
;;   ;; Disable apostrophe and backtick pairing in Lisp-like modes
;;   (sp-with-modes '(minibuffer-mode minibuffer-inactive-mode org-mode)
;;     (sp-local-pair "`" nil :actions nil)
;;     (sp-local-pair "'" nil :actions nil))
;; 
;;   (smartparens-global-mode +1))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode)
  :init
  (setq rainbow-delimiters-max-face-count 4))
