tag-emacs/config/emacs/profiles/oikeiosis/README.org
*** Snippets

 I use =yasnippet= to manage snippets to quickly generate repeated blocks of code, such as Org mode source blocks. I currently do not have a complicated snippet setup because it's something that I end up fighting more than liking when I use pre-made snippet libraries. As such, I am building it as I go along.

 One thing that I found interesting when reading through Doom's snippet system is the [[https://github.com/abo-abo/auto-yasnippet][auto-yasnippet]] package as a compliment to Evil mode macros. I do not currently have that installed but want to note it for later consideration

 I store my snippets in the private directory because I consider them configuration instead of data files. This is debatable, but it works for now.

 #+begin_src elisp
 (defvar oik-snippets-dir (expand-file-name "snippets/" oik-private-dir)
   "The directory in which the snippet system should store snippets.")
 #+end_src

**** =yasnippet=

 - links :: [[https://melpa.org/#/yasnippet][melpa]], [[https://github.com/joaotavora/yasnippet][source]]

 =yasnippet= is a large package so I mark the commands that I use as possible lazy load targets. This later accomplishes nothing though because I eagerly turn on =yas-global-mode= so that I may use my snippets in all modes that have them. I find the crib sheet useful for keeping things fresh in my mind.

#+begin_src elisp
(use-package yasnippet
  :commands (yas-minor-mode-on
             yas-expand
             yas-expand-snippet
             yas-lookup-snippet
             yas-insert-snippet
             yas-new-snippet
             yas-visit-snippet-file
             yas-activate-extra-mode
             yas-deactivate-extra-mode
             yas-maybe-expand-abbrev-key-filter)
  :init
  (setq yas-snippet-dirs nil)
  :config
  (setq yas-verbosity 2
        yas-prompt-functions
        '(yas-completing-prompt
          yas-maybe-ido-prompt
          yas-no-prompt))

  (defun oik-remove-duplicate-snippets-a (templates)
    "Remove duplicate TEMPLATES for the yasnippet list.

I don't know why this happens, but it is irritating and confusing when I see a
snippet listed twice."
    (cl-delete-duplicates templates :test #'equal))

  (general-add-advice #'yas--all-templates
                      :filter-return
                      #'oik-remove-duplicate-snippets-a)

  (add-to-list 'yas-snippet-dirs oik-snippets-dir)
  (add-to-list 'load-path oik-snippets-dir)

  (yas-global-mode +1))
#+end_src

** Org mode

Org mode is a (the?) major reason why I use Emacs. I find the promise of storing all of my notes, literate programming like this configuration, my todos, and nearly everything else in a single, text-oriented form alluring. As such, I need to configure Org to my liking.

To start, I store my Org files in my home directory.

#+begin_src elisp :noweb-ref org-config :noweb-sep "\n\n"
(setq org-directory "~/org")
#+end_src

*** Look and feel

When opening an indirect buffer, I like to think of it as zooming into the document. As such, I create the indirect buffer within the current window.

#+begin_src elisp :noweb-ref org-look-and-feel :noweb-sep "\n\n"
(setq org-indirect-buffer-display 'current-window)
#+end_src

Org mode likes to push things far to the right, in particular when you edit Emacs Lisp within it. To fight this somewhat, I disable the indentation of source blocks, showing them against the left margin. Since

#+begin_src elisp :tangle no :noweb-ref org-look-and-feel :noweb-sep "\n\n"
(setq org-edit-src-content-indentation 0)
#+end_src

The Org ellipsis shows collapsed trees. I like the idea of showing these with a downward arrow.

#+begin_src elisp :tangle no :noweb-ref org-look-and-feel :noweb-sep "\n\n"
(setq org-ellipsis "  ")
#+end_src

To encourage my Org mode writing to be more like a writing environment, I hide emphasis markers like =*bold*= and =/italics/=.

#+begin_src elisp :tangle no :noweb-ref org-look-and-feel :noweb-sep "\n\n"
(setq org-hide-emphasis-markers t)
#+end_src

Literate programming in Org is wonderful. To make sure it applies syntax highlighting correctly to source blocks, I explicitly enable it even though it's enabled by default since Org 8.3

#+begin_src elisp :tangle no :noweb-ref org-look-and-feel :noweb-sep "\n\n"
(setq org-src-fontify-natively t)
#+end_src

**** Numbering

#+begin_src elisp
(defgroup oik-faces ()
  "Faces defined specifically for Oikei么sis."
  :group 'faces
  :prefix "oik-")
#+end_src

#+begin_src elisp
(defface oik-org-num-numbering nil
  "The face for high level Org mode numbering."
  :group 'oik-faces)
#+end_src


#+begin_src elisp
;; (defun oik--org-num-format (numbering)
;;   "Formats Org mode headline NUMBERING."
;;   (if (= (length numbering) 1)
;;       (propertize (concat (mapconcat #'number-to-string numbering ".") " | ")
;;                   'face
;;                   `(:family "Fira Sans" :width 'condensed :height 250 :foreground "#686868"))
;;     (propertize (concat (mapconcat #'number-to-string numbering ".") "  ")
;;                 'face
;;                 'oik-org-num-numbering)))
(defun oik--org-num-format (numbering)
  "Formats Org mode headline NUMBERING."
  (if (= (length numbering) 1)
      (concat (mapconcat #'number-to-string numbering ".") " | ")
    (concat (mapconcat #'number-to-string numbering ".") "  ")))
#+end_src

#+begin_src elisp :tangle no :noweb-ref org-look-and-feel :noweb-sep "\n\n"
(general-with-eval-after-load 'org-num
  (setq org-num-skip-unnumbered t
        org-num-skip-footnotes t
        org-num-max-level 4
        org-num-face 'oik-org-num-numbering
        org-num-format-function #'oik--org-num-format))
#+end_src

**** Faces

Stylizing plain lists, which I write with =-=, with bullets makes them easier on the eyes. This uses font lock to do just that.

#+begin_src elisp :tangle no :noweb-ref org-look-and-feel :noweb-sep "\n\n"
(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) ""))))))
#+end_src

Being mostly prose, I like to style Org mode with that in mind. These changes use a [[https://www.modularscale.com/?1&em&1.067][minor second modular scale]] for sizing headlines to make them visually distinct. I find that using =org-bullets= makes it hard to see which level I'm at in the tree, so I chose this approach as an alternative. Because I use =variable-pitch-mode= as well, I find that I must hunt-and-peck to make sure things that should be fixed pitch end up that way. Heavy inspiration for this section comes from [[https://zzamboni.org/post/beautifying-org-mode-in-emacs/][Beautifying Org Mode in Emacs]].

#+begin_src elisp :tangle no :noweb-ref org-look-and-feel :noweb-sep "\n\n"
(custom-theme-set-faces
 'user
 '(org-document-title ((t (:inherit default :family "Fira Sans" :weight ultra-bold :height 200))))
 '(org-level-1        ((t (:inherit default :family "Fira Sans" :weight bold :height 180))))
 '(org-level-2        ((t (:inherit default :family "Fira Sans" :weight bold :height 160))))
 '(org-level-3        ((t (:inherit default :family "Fira Sans" :weight semi-bold :height 150))))
 '(org-level-4        ((t (:inherit default :family "Fira Sans" :weight semi-bold))))
 '(org-level-5        ((t (:inherit default :family "Fira Sans" :weight semi-bold))))
 '(org-level-6        ((t (:inherit default :family "Fira Sans" :weight semi-bold))))
 '(org-level-7        ((t (:inherit default :family "Fira Sans" :weight semi-bold))))
 '(org-level-8        ((t (:inherit default :family "Fira Sans" :weight semi-bold))))

 '(org-block                 ((t (:inherit fixed-pitch))))
 '(org-block-end-line        ((t (:inherit org-block-begin-line))))
 '(org-checkbox              ((t (:inherit fixed-pitch))))
 '(org-code                  ((t (:inherit (shadow fixed-pitch)))))
 '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
 '(org-ellipsis              ((t (:inherit default :height 0.8))))
 '(org-formula               ((t (:inherit fixed-pitch))))
 '(org-indent                ((t (:inherit (org-hide fixed-pitch)))))
 '(org-meta-line             ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-property-value        ((t (:inherit fixed-pitch))) t)
 '(org-special-keyword       ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-table                 ((t (:inherit fixed-pitch))))
 '(org-tag                   ((t (:inherit fixed-pitch))))
 '(org-todo                  ((t (:inherit fixed-pitch))))
 '(org-verbatim              ((t (:inherit (shadow fixed-pitch))))))
#+end_src

#+begin_src elisp :tangle no :noweb-ref org-look-and-feel :noweb-sep "\n\n"
(custom-theme-set-faces
 'apropospriate-dark
 '(oik-org-num-numbering ((t (:family "Fira Sans" :width condensed :foreground "#686868")))))

(custom-theme-set-faces
 'apropospriate-light
 '(oik-org-num-numbering ((t (:family "Fira Sans" :width condensed :foreground "#c8c8c8")))))
#+end_src


On the agenda, I like to see different priorities set with different faces. As deadlines approach, the faces get gradually more aggressive to catch my attention.

#+begin_src elisp :tangle no :noweb-ref org-look-and-feel :noweb-sep "\n\n"
(setq org-agenda-deadline-faces '((1.001 . error)
                                  (1.0 . org-imminent-deadline)
                                  (0.5 . org-upcoming-deadline)
                                  (0.0 . org-upcoming-distant-deadline)))
#+end_src

To make it easier to theme specific functionality within Org mode buffers, I enable all of the optional fontification.

