tag-emacs/config/emacs/profiles/oikeiosis/init.el

 (defvar oik-snippets-dir (expand-file-name "snippets/" oik-private-dir)
   "The directory in which the snippet system should store snippets.")

(use-package yasnippet
  :commands (yas-minor-mode-on
             yas-expand
             yas-expand-snippet
             yas-lookup-snippet
             yas-insert-snippet
             yas-new-snippet
             yas-visit-snippet-file
             yas-activate-extra-mode
             yas-deactivate-extra-mode
             yas-maybe-expand-abbrev-key-filter)
  :init
  (setq yas-snippet-dirs nil)
  :config
  (setq yas-verbosity 2
        yas-prompt-functions
        '(yas-completing-prompt
          yas-maybe-ido-prompt
          yas-no-prompt))

  (defun oik-remove-duplicate-snippets-a (templates)
    "Remove duplicate TEMPLATES for the yasnippet list.

I don't know why this happens, but it is irritating and confusing when I see a
snippet listed twice."
    (cl-delete-duplicates templates :test #'equal))

  (general-add-advice #'yas--all-templates
                      :filter-return
                      #'oik-remove-duplicate-snippets-a)

  (add-to-list 'yas-snippet-dirs oik-snippets-dir)
  (add-to-list 'load-path oik-snippets-dir)

  (yas-global-mode +1))

(setq org-directory "~/org")

(setq org-indirect-buffer-display 'current-window)

(defgroup oik-faces ()
  "Faces defined specifically for Oikeiôsis."
  :group 'faces
  :prefix "oik-")

(defface oik-org-num-numbering nil
  "The face for high level Org mode numbering."
  :group 'oik-faces)

;; (defun oik--org-num-format (numbering)
;;   "Formats Org mode headline NUMBERING."
;;   (if (= (length numbering) 1)
;;       (propertize (concat (mapconcat #'number-to-string numbering ".") " | ")
;;                   'face
;;                   `(:family "Fira Sans" :width 'condensed :height 250 :foreground "#686868"))
;;     (propertize (concat (mapconcat #'number-to-string numbering ".") " — ")
;;                 'face
;;                 'oik-org-num-numbering)))
(defun oik--org-num-format (numbering)
  "Formats Org mode headline NUMBERING."
  (if (= (length numbering) 1)
      (concat (mapconcat #'number-to-string numbering ".") " | ")
    (concat (mapconcat #'number-to-string numbering ".") " — ")))

(use-package org
  :hook (org-mode . org-num-mode)
  :general
  (org-mode-map
   [tab] #'org-cycle)
  :config
  (setq org-modules '(org-habit))

  (setq org-directory "~/org")
  
  (setq org-enforce-todo-dependencies t
        org-enforce-todo-checkbox-dependencies t)
  
  (setq-default org-agenda-files (list org-directory))
  
  (setq org-agenda-skip-unavailable-files t)
  
  (setq org-agenda-start-on-weekday 0)

  (setq org-indirect-buffer-display 'current-window)
  
  (setq org-edit-src-content-indentation 0)
  
  (setq org-ellipsis " ▼ ")
  
  (setq org-hide-emphasis-markers t)
  
  (setq org-src-fontify-natively t)
  
  (general-with-eval-after-load 'org-num
    (setq org-num-skip-unnumbered t
          org-num-skip-footnotes t
          org-num-max-level 4
          org-num-face 'oik-org-num-numbering
          org-num-format-function #'oik--org-num-format))
  
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
  
  (custom-theme-set-faces
   'user
   '(org-document-title ((t (:inherit default :family "Fira Sans" :weight ultra-bold :height 200))))
   '(org-level-1        ((t (:inherit default :family "Fira Sans" :weight bold :height 180))))
   '(org-level-2        ((t (:inherit default :family "Fira Sans" :weight bold :height 160))))
   '(org-level-3        ((t (:inherit default :family "Fira Sans" :weight semi-bold :height 150))))
   '(org-level-4        ((t (:inherit default :family "Fira Sans" :weight semi-bold))))
   '(org-level-5        ((t (:inherit default :family "Fira Sans" :weight semi-bold))))
   '(org-level-6        ((t (:inherit default :family "Fira Sans" :weight semi-bold))))
   '(org-level-7        ((t (:inherit default :family "Fira Sans" :weight semi-bold))))
   '(org-level-8        ((t (:inherit default :family "Fira Sans" :weight semi-bold))))
  
   '(org-block                 ((t (:inherit fixed-pitch))))
   '(org-block-end-line        ((t (:inherit org-block-begin-line))))
   '(org-checkbox              ((t (:inherit fixed-pitch))))
   '(org-code                  ((t (:inherit (shadow fixed-pitch)))))
   '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
   '(org-ellipsis              ((t (:inherit default :height 0.8))))
   '(org-formula               ((t (:inherit fixed-pitch))))
   '(org-indent                ((t (:inherit (org-hide fixed-pitch)))))
   '(org-meta-line             ((t (:inherit (font-lock-comment-face fixed-pitch)))))
   '(org-property-value        ((t (:inherit fixed-pitch))) t)
   '(org-special-keyword       ((t (:inherit (font-lock-comment-face fixed-pitch)))))
   '(org-table                 ((t (:inherit fixed-pitch))))
   '(org-tag                   ((t (:inherit fixed-pitch))))
   '(org-todo                  ((t (:inherit fixed-pitch))))
   '(org-verbatim              ((t (:inherit (shadow fixed-pitch))))))
  
  (custom-theme-set-faces
   'apropospriate-dark
   '(oik-org-num-numbering ((t (:family "Fira Sans" :width condensed :foreground "#686868")))))
  
  (custom-theme-set-faces
   'apropospriate-light
   '(oik-org-num-numbering ((t (:family "Fira Sans" :width condensed :foreground "#c8c8c8")))))
  
  (setq org-agenda-deadline-faces '((1.001 . error)
                                    (1.0 . org-imminent-deadline)
                                    (0.5 . org-upcoming-deadline)
                                    (0.0 . org-upcoming-distant-deadline)))
