tag-emacs/config/emacs/profiles/oikeiosis/README.org
****** Theme-specific

My preferred theme does not stylize the habit tracker out-of-the-box, so I also define some faces here to match the dark and light colorschemes.

#+begin_src elisp :tangle no :noweb-ref org-look-and-feel :noweb-sep "\n\n"
(general-with-eval-after-load 'org-habit
  (custom-theme-set-faces
   'apropospriate-dark
   '(org-habit-alert-face          ((t (:foreground "#424242" :background "#FFEE9D"))))
   '(org-habit-alert-future-face   ((t (:background "#FFEE58"))))
   '(org-habit-clear-face          ((t (:background "#E1BEE7"))))
   '(org-habit-clear-future-face   ((t (:background "#9575CD"))))
   '(org-habit-overdue-face        ((t (:background "#E57373"))))
   '(org-habit-overdue-future-face ((t (:background "#EF9A9A"))))
   '(org-habit-ready-face          ((t (:foreground "#424242" :background "#C5E1A5"))))
   '(org-habit-ready-future-face   ((t (:background "#F4FF81")))))

  (custom-theme-set-faces
   'apropospriate-light
   '(org-habit-alert-face          ((t (:foreground "#424242" :background "#F9A725"))))
   '(org-habit-alert-future-face   ((t (:background "#F57F17"))))
   '(org-habit-clear-face          ((t (:background "#7E57C2"))))
   '(org-habit-clear-future-face   ((t (:background "#B388FF"))))
   '(org-habit-overdue-face        ((t (:background "#D50000"))))
   '(org-habit-overdue-future-face ((t (:background "#FF1744"))))
   '(org-habit-ready-face          ((t (:foreground "#424242" :background "#66BB6A"))))
   '(org-habit-ready-future-face   ((t (:background "#558B2F"))))))
#+end_src

*** Task management

For projects, I want to make sure I don't accidentally complete a project before all of its subtasks are done and the same for checklists. To prevent this, I enforce dependencies for both features.

#+begin_src elisp :tangle no :noweb-ref org-config :noweb-sep "\n\n"
(setq org-enforce-todo-dependencies t
      org-enforce-todo-checkbox-dependencies t)
#+end_src

**** Agenda

The agenda is a key part of using the task management functionality of Org mode. This section configures the agenda to my liking.

By default, I want to include all files within my Org directory. I sometimes override this on individual machines.

#+begin_src elisp :tangle no :noweb-ref org-config :noweb-sep "\n\n"
(setq-default org-agenda-files (list org-directory))
#+end_src

When showing the agenda, I don't want missing files to impede the view, so I allow skipping unavailable files.

#+begin_src elisp :tangle no :noweb-ref org-config :noweb-sep "\n\n"
(setq org-agenda-skip-unavailable-files t)
#+end_src

I'm an American and thus, my brain has learned to associate the beginning on the week with Sunday. I've tried over the years to retrain myself to think of Monday as the first day of the week, but this has always ended up causing issues where I don't realize that I'm thinking of the days wrong. To work with my brain instead of against it, I start my agenda on Sundays.

#+begin_src elisp :tangle no :noweb-ref org-config :noweb-sep "\n\n"
(setq org-agenda-start-on-weekday 0)
#+end_src

*** Initialization

#+begin_src elisp :noweb tangle
(use-package org
  :hook (org-mode . org-num-mode)
  :general
  (org-mode-map
   [tab] #'org-cycle)
  :config
  (setq org-modules '(org-habit))

  <<org-config>>

  <<org-look-and-feel>>

  (setq org-insert-heading-respect-content nil))
#+end_src

*** org-appear

- links :: [[https://melpa.org/#/org-appear][melpa]], [[https://github.com/awth13/org-appear][source]]

Org mode is for writing (well, and a million other things, but primarily writing). As such, I like to see the prose without markup as much as possible. However, setting =org-hide-emphasis-markers= makes it difficult to /edit/ marked up prose. To remedy the situation, =org-appear= shows markup whenever the cursor is inside some markup. This gives the best of both worlds.

There's one caveat that I have noticed. When moving the cursor into a marked up region, I need to press =h= or =l= an extra time after crossing the border. This can break my concentration because my brain expects it to jump over the symbol. I think I will get used to this, but it might be worth investigating some advice to automatically handle the extra movement.

#+begin_src elisp
(use-package org-appear
  :after org
  :hook (org-mode . org-appear-mode))
#+end_src

** Programming languages
*** TODO Emacs Lisp

#+begin_src elisp
(defvar oik--emacs-lisp-function-face nil
  "The face to use for enhanced Emacs lisp function highlighting.")
#+end_src

#+begin_src elisp
(defun oik-emacs-lisp-highlight-vars-and-faces (end)
  "Match until END defined variables and functions.

This differentiates functions into special forms: built-in functions and
user-defined ones.

I lifted this from Doom Emacs because it's helpful to see which types of
functions are which."
  (catch 'matcher
    (while (re-search-forward "\\(?:\\sw\\|\\s_\\)+" end t)
      (let ((ppss (save-excursion (syntax-ppss))))
        (cond ((nth 3 ppss) (search-forward "\"" end t))
              ((nth 4 ppss) (forward-line +1))
              ((let ((symbol (intern-soft (match-string-no-properties 0))))
                 (and (cond ((null symbol) nil)
                            ((eq symbol t) nil)
                            ((keywordp symbol) nil)
                            ((special-variable-p symbol)
                             (setq oik--emacs-lisp-function-face 'font-lock-variable-name-face))
                            ((and (fboundp symbol)
                                  (eq (char-before (match-beginning 0)) ?\()
                                  (not (memq (char-before (1- (match-beginning 0)))
                                             (list ?\' ?\`))))
                             (let ((unaliased (indirect-function symbol)))
                               (unless (or (macrop unaliased)
                                           (special-form-p unaliased))
                                 (let (unadvised)
                                   (while (not (eq (setq unadvised (ad-get-orig-definition unaliased))
                                                   (setq unaliased (indirect-function unadvised)))))
                                   unaliased)
                                 (setq oik--emacs-lisp-function-face
                                       (if (subrp unaliased)
                                           'font-lock-constant-face
                                         'font-lock-function-name-face))))))
                      (throw 'matcher t)))))))))
#+end_src

Ensure that Emacs byte-compiles expensive font lock functions so they run as fast as possible. Font locking is already expensive so customizations need to be mindful of that.

#+begin_src elisp
(dolist (fn '(oik-emacs-lisp-highlight-vars-and-faces))
  (unless (byte-code-function-p (symbol-function fn))
    (with-no-warnings (byte-compile fn))))
#+end_src

Enable highlighting variables and faces by adding the function to font lock.

#+begin_src elisp
(font-lock-add-keywords
 'emacs-lisp-mode
 `((oik-emacs-lisp-highlight-vars-and-faces . oik--emacs-lisp-function-face)))
#+end_src


I don't deal with a lot of external lisp code, so trusting local variables makes sense to me. Doom logs them when they are set, just in case, but I don't do that for the moment.

#+begin_src elisp
(setq-default enable-local-variables :safe)
#+end_src

**** TODO elisp-demos

#+begin_src elisp
(use-package elisp-demos
  :defer t
  :init
  (general-add-advice 'describe-function-1 :after #'elisp-demos-advice-describe-function-1)
  (general-add-advice 'helpful-update :after #'elisp-demos-advice-helpful-update))
#+end_src

**** TODO highlight-quoted

Seeing quoted symbols as different makes it easier to scan through Emacs Lisp code and find what you're looking for. Because of that, I use =highlight-quoted-mode= to help.

#+begin_src elisp
(use-package highlight-quoted
  :hook (emacs-lisp-mode . highlight-quoted-mode))
#+end_src

** TODO To sort

*** tree-sitter

#+begin_src elisp
(use-package tree-sitter
  :elpaca '(:build (:not native-compile))
  :config
  (global-tree-sitter-mode +1)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

(use-package tree-sitter-langs
  :after tree-sitter
  :elpaca '(:build (:not native-compile)))
#+end_src

*** rainbow-mode

- links :: [[https://elpa.gnu.org/packages/rainbow-mode.html][elpa]], [[https://git.savannah.gnu.org/cgit/emacs/elpa.git/?h=externals/rainbow-mode][source]]

#+begin_src elisp
(use-package rainbow-mode
  :hook (emacs-lisp-mode org-mode))
#+end_src


