tag-emacs/config/emacs/profiles/oikeiosis/init.el
  
  (general-with-eval-after-load 'org-habit
    (custom-theme-set-faces
     'apropospriate-dark
     '(org-habit-alert-face          ((t (:foreground "#424242" :background "#FFEE9D"))))
     '(org-habit-alert-future-face   ((t (:background "#FFEE58"))))
     '(org-habit-clear-face          ((t (:background "#E1BEE7"))))
     '(org-habit-clear-future-face   ((t (:background "#9575CD"))))
     '(org-habit-overdue-face        ((t (:background "#E57373"))))
     '(org-habit-overdue-future-face ((t (:background "#EF9A9A"))))
     '(org-habit-ready-face          ((t (:foreground "#424242" :background "#C5E1A5"))))
     '(org-habit-ready-future-face   ((t (:background "#F4FF81")))))
  
    (custom-theme-set-faces
     'apropospriate-light
     '(org-habit-alert-face          ((t (:foreground "#424242" :background "#F9A725"))))
     '(org-habit-alert-future-face   ((t (:background "#F57F17"))))
     '(org-habit-clear-face          ((t (:background "#7E57C2"))))
     '(org-habit-clear-future-face   ((t (:background "#B388FF"))))
     '(org-habit-overdue-face        ((t (:background "#D50000"))))
     '(org-habit-overdue-future-face ((t (:background "#FF1744"))))
     '(org-habit-ready-face          ((t (:foreground "#424242" :background "#66BB6A"))))
     '(org-habit-ready-future-face   ((t (:background "#558B2F"))))))

  (setq org-insert-heading-respect-content nil))

(use-package org-appear
  :after org
  :hook (org-mode . org-appear-mode))

(defvar oik--emacs-lisp-function-face nil
  "The face to use for enhanced Emacs lisp function highlighting.")

(defun oik-emacs-lisp-highlight-vars-and-faces (end)
  "Match until END defined variables and functions.

This differentiates functions into special forms: built-in functions and
user-defined ones.

I lifted this from Doom Emacs because it's helpful to see which types of
functions are which."
  (catch 'matcher
    (while (re-search-forward "\\(?:\\sw\\|\\s_\\)+" end t)
      (let ((ppss (save-excursion (syntax-ppss))))
        (cond ((nth 3 ppss) (search-forward "\"" end t))
              ((nth 4 ppss) (forward-line +1))
              ((let ((symbol (intern-soft (match-string-no-properties 0))))
                 (and (cond ((null symbol) nil)
                            ((eq symbol t) nil)
                            ((keywordp symbol) nil)
                            ((special-variable-p symbol)
                             (setq oik--emacs-lisp-function-face 'font-lock-variable-name-face))
                            ((and (fboundp symbol)
                                  (eq (char-before (match-beginning 0)) ?\()
                                  (not (memq (char-before (1- (match-beginning 0)))
                                             (list ?\' ?\`))))
                             (let ((unaliased (indirect-function symbol)))
                               (unless (or (macrop unaliased)
                                           (special-form-p unaliased))
                                 (let (unadvised)
                                   (while (not (eq (setq unadvised (ad-get-orig-definition unaliased))
                                                   (setq unaliased (indirect-function unadvised)))))
                                   unaliased)
                                 (setq oik--emacs-lisp-function-face
                                       (if (subrp unaliased)
                                           'font-lock-constant-face
                                         'font-lock-function-name-face))))))
                      (throw 'matcher t)))))))))

(dolist (fn '(oik-emacs-lisp-highlight-vars-and-faces))
  (unless (byte-code-function-p (symbol-function fn))
    (with-no-warnings (byte-compile fn))))

(font-lock-add-keywords
 'emacs-lisp-mode
 `((oik-emacs-lisp-highlight-vars-and-faces . oik--emacs-lisp-function-face)))

(setq-default enable-local-variables :safe)

(use-package elisp-demos
  :defer t
  :init
  (general-add-advice 'describe-function-1 :after #'elisp-demos-advice-describe-function-1)
  (general-add-advice 'helpful-update :after #'elisp-demos-advice-helpful-update))

(use-package highlight-quoted
  :hook (emacs-lisp-mode . highlight-quoted-mode))

(use-package tree-sitter
  :elpaca '(:build (:not native-compile))
  :config
  (global-tree-sitter-mode +1)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

(use-package tree-sitter-langs
  :after tree-sitter
  :elpaca '(:build (:not native-compile)))

(use-package rainbow-mode
  :hook (emacs-lisp-mode org-mode))
